ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
#include "app_ui.h"

#include <stdbool.h>
#include <string.h>
#include <stdint.h>
#include <stdlib.h>

#include "app_ui_font_cn_16.h"
#include "app_ui_font_cn_24.h"
#include "assistant_mode.h"
#include "assistant_router.h"
#include "audio_self_test.h"
#include "board_mapping.h"
#include "board_snapshot.h"
#include "circuit_debug.h"
#include "circuit_layout.h"
#include "game_judge.h"
#include "level_rules.h"
#include "play_mode.h"
#include "campaign_content.h"
#include "campaign_progress.h"
#include "progress_sync.h"
#include "shooter_font_cn_16.h"
#include "shooter_game.h"
#include "volcengine_voice.h"
#include "esp_check.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_lv_adapter.h"
#include "esp_lv_adapter_display.h"
#include "lvgl.h"

#include "bsp/display.h"
#include "bsp/esp32_p4_function_ev_board.h"
#include "bsp/touch.h"

#define UI_SCREEN_WIDTH            1024
#define UI_SCREEN_HEIGHT           600
#define UI_HEADER_HEIGHT           76
#define UI_MAX_NODES               24
#define UI_CAMPAIGN_SUMMARY_SIZE   768
#define UI_MAP_X                   18
#define UI_MAP_Y                   90
#define UI_MAP_WIDTH               724
#define UI_MAP_HEIGHT              500
#define UI_NODE_WIDTH              118
#define UI_NODE_HEIGHT             64
#define UI_MAP_GRID_SIZE           56

#define UI_COLOR_BG                0x0A0E27
#define UI_COLOR_SURFACE           0x0F1B3D
#define UI_COLOR_SURFACE_ALT       0x162451
#define UI_COLOR_SURFACE_HI        0x24315B
#define UI_COLOR_BORDER            0x294B78
#define UI_COLOR_GRID              0x1B2C55
#define UI_COLOR_CYAN              0x5EDCF4
#define UI_COLOR_CYAN_DIM          0x2C90B6
#define UI_COLOR_PINK              0xF0A6CA
#define UI_COLOR_YELLOW            0xF4D03F
#define UI_COLOR_AMBER             UI_COLOR_YELLOW
#define UI_COLOR_GREEN             0x75E6B0
#define UI_COLOR_TEXT              0xF4F0FF
#define UI_COLOR_MUTED             0xB9B7D5
#define UI_COLOR_RED               0xFF5B66
#define UI_COLOR_DANGER            0xFF7895

typedef enum {
    UI_PAGE_HOME = 0,
    UI_PAGE_CAMPAIGN,
    UI_PAGE_DETAIL,
    UI_PAGE_PLAY,
    UI_PAGE_SUCCESS,
    UI_PAGE_SETTINGS,
    UI_PAGE_DIAGNOSTICS,
    UI_PAGE_SHOOTER,
    UI_PAGE_COUNT,
} ui_page_t;

typedef enum {
    UI_HOME_CAMPAIGN = 0,
    UI_HOME_SETTINGS,
    UI_HOME_COUNT,
} ui_home_item_t;

typedef enum {
    UI_SETTINGS_SPEAKER_TEST = 0,
    UI_SETTINGS_PROGRESS_SYNC,
    UI_SETTINGS_UNLOCK_ALL,
    UI_SETTINGS_INITIALIZE,
    UI_SETTINGS_ASSISTANT_MODE,
    UI_SETTINGS_COUNT,
} ui_settings_item_t;

typedef struct {
    lv_obj_t *screen[UI_PAGE_COUNT];
    lv_obj_t *home_items[UI_HOME_COUNT];
    lv_obj_t *settings_items[UI_SETTINGS_COUNT];
    lv_obj_t *map;
    lv_obj_t *map_nodes[UI_MAX_NODES];
    lv_obj_t *map_node_ids[UI_MAX_NODES];
    lv_obj_t *map_node_titles[UI_MAX_NODES];
    lv_obj_t *campaign_code;
    lv_obj_t *campaign_title;
    lv_obj_t *campaign_goal;
    lv_obj_t *campaign_gate_reward;
    lv_obj_t *campaign_ship_reward;
    lv_obj_t *detail_code;
    lv_obj_t *detail_title;
    lv_obj_t *detail_story;
    lv_obj_t *detail_availability;
    lv_obj_t *detail_availability_dot;
    lv_obj_t *detail_availability_label;
    lv_obj_t *detail_gate_reward;
    lv_obj_t *detail_ship_reward;
    lv_obj_t *detail_start;
    lv_obj_t *detail_start_label;
    lv_obj_t *settings_sync_status;
    lv_obj_t *settings_unlock_status;
    lv_obj_t *settings_initialize_status;
    lv_obj_t *settings_assistant_status;
    lv_obj_t *play_circuit;
    lv_obj_t *play_code;
    lv_obj_t *play_title;
    lv_obj_t *play_goal;
    lv_obj_t *play_truth;
    lv_obj_t *play_status;
    lv_obj_t *play_action;
    lv_obj_t *play_action_label;
    lv_obj_t *play_debug_action;
    lv_obj_t *play_debug_action_label;
    lv_obj_t *success_code;
    lv_obj_t *success_title;
    lv_obj_t *success_status;
    lv_obj_t *debug_keys;
    lv_obj_t *debug_joystick;
    lv_obj_t *debug_switches;
    lv_obj_t *debug_ir;
    lv_obj_t *debug_mic;
    lv_obj_t *debug_tone;
    lv_obj_t *debug_mic_bar;
} ui_objects_t;

static const char *TAG = "app_ui";
static ui_objects_t s_ui;
static ui_page_t s_page = UI_PAGE_HOME;
static uint8_t s_home_selection = UI_HOME_CAMPAIGN;
static uint8_t s_settings_selection = UI_SETTINGS_SPEAKER_TEST;
static uint16_t s_node_count;
static uint16_t s_selected_node;
static int32_t s_map_offset_x;
static int32_t s_map_offset_y;
static char s_campaign_summary[UI_CAMPAIGN_SUMMARY_SIZE];
static key_input_state_t s_previous_keys;
static joystick_input_state_t s_previous_joystick;
static bool s_input_initialized;
static bool s_completed_nodes[UI_MAX_NODES];
static bool s_unlock_all_nodes;
static bool s_initialize_error;
static progress_sync_status_t s_last_progress_sync_status;
static bool s_progress_sync_status_initialized;
static uint8_t s_play_action_selection;
static board_snapshot_t s_play_snapshot;
static circuit_layout_t s_play_layout;
static uint32_t s_play_snapshot_generation;
static uint32_t s_play_topology_revision;
static uint32_t s_play_judge_version;
static uint32_t s_play_debug_generation;
static uint32_t s_play_voice_generation;
static bool s_programmer_owns_input;
static char s_play_goal_text[384];
static int64_t s_last_play_health_log_us;

static const campaign_node_t *ui_nodes(void)
{
    return campaign_content_nodes(NULL);
}

static int32_t ui_find_node_index(const campaign_node_t *nodes,
                                  uint16_t count,
                                  uint16_t node_id)
{
    for (uint16_t index = 0; index < count; ++index) {
        if (nodes[index].id == node_id) {
            return (int32_t)index;
        }
    }
    return -1;
}

static uint16_t ui_gate_unlock_level(ssd1315_gate_t gate)
{
    switch (gate) {
    case SSD1315_GATE_NAND: return 101U;
    case SSD1315_GATE_NOT: return 103U;
    case SSD1315_GATE_AND: return 201U;
    case SSD1315_GATE_OR: return 202U;
    case SSD1315_GATE_NOR: return 203U;
    case SSD1315_GATE_XOR: return 301U;
    case SSD1315_GATE_XNOR: return 302U;
    default: return 0U;
    }
}

static bool ui_gate_is_unlocked_for_progress(ssd1315_gate_t gate,
                                              const bool *completed)
{
    if (gate == SSD1315_GATE_INPUT || gate == SSD1315_GATE_OUTPUT) return true;
    if (completed == NULL) return false;
    const uint16_t level_id = ui_gate_unlock_level(gate);
    if (level_id == 0U) return false;
    const int32_t index = ui_find_node_index(ui_nodes(), s_node_count, level_id);
    return index >= 0 && completed[index];
}

bool app_ui_gate_is_unlocked(ssd1315_gate_t gate)
{
    return ui_gate_is_unlocked_for_progress(gate, s_completed_nodes);
}

static bool ui_node_is_unlocked_for_progress(uint16_t index,
                                             const bool *completed,
                                             bool unlock_all)
{
    const campaign_node_t *nodes = ui_nodes();
    if (index >= s_node_count || completed == NULL) {
        return false;
    }
    if (unlock_all || completed[index]) {
        return true;
    }
    if (nodes[index].prerequisite_count == 0U) {
        return nodes[index].id == campaign_content_meta().initial_level_id;
    }
    for (uint8_t prerequisite = 0U;
         prerequisite < nodes[index].prerequisite_count;
         ++prerequisite) {
        const int32_t parent = ui_find_node_index(
            nodes, s_node_count, nodes[index].prerequisite_ids[prerequisite]);
        if (parent < 0 || !completed[parent]) {
            return false;
        }
    }
    return true;
}

static bool ui_node_is_unlocked(uint16_t index)
{
    return ui_node_is_unlocked_for_progress(index, s_completed_nodes, s_unlock_all_nodes);
}

static const int16_t s_star_points[][3] = {
    {42, 96, 3}, {132, 164, 2}, {220, 106, 4}, {318, 188, 2},
    {414, 102, 3}, {506, 158, 2}, {612, 94, 3}, {736, 148, 2},
    {842, 106, 4}, {956, 180, 2}, {70, 540, 2}, {176, 518, 3},
    {286, 566, 2}, {438, 532, 3}, {580, 548, 2}, {708, 524, 3},
    {888, 548, 2}, {980, 506, 3}, {522, 78, 2}, {764, 72, 2},
};
static const uint32_t s_star_colors[] = {UI_COLOR_CYAN, UI_COLOR_PINK, UI_COLOR_YELLOW};

static void ui_load_page(ui_page_t page);
static void ui_refresh_campaign(void);
static void ui_refresh_detail(void);
static void ui_refresh_play(void);
static void ui_refresh_success(void);
static void ui_create_play_screen(void);
static void ui_create_success_screen(void);
static void ui_exit_shooter_to_campaign(void);
static void ui_record_node_completion(uint16_t index);

static void ui_set_font(lv_obj_t *object)
{
    lv_obj_set_style_text_font(object, &app_ui_font_cn_16, 0);
}

static void ui_style_screen(lv_obj_t *screen)
{
    lv_obj_set_style_bg_color(screen, lv_color_hex(UI_COLOR_BG), 0);
    lv_obj_set_style_bg_opa(screen, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(screen, 0, 0);
    lv_obj_set_style_pad_all(screen, 0, 0);
    lv_obj_clear_flag(screen, LV_OBJ_FLAG_SCROLLABLE);
}

static void ui_style_panel(lv_obj_t *panel, uint32_t background, uint32_t border)
{
    lv_obj_set_style_bg_color(panel, lv_color_hex(background), 0);
    lv_obj_set_style_bg_opa(panel, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(panel, lv_color_hex(border), 0);
    lv_obj_set_style_border_width(panel, 1, 0);
    lv_obj_set_style_radius(panel, 2, 0);
    lv_obj_set_style_pad_all(panel, 0, 0);
    lv_obj_clear_flag(panel, LV_OBJ_FLAG_SCROLLABLE);
}

static lv_obj_t *ui_create_label(lv_obj_t *parent,
                                 const char *text,
                                 int32_t x,
                                 int32_t y,
                                 int32_t width,
                                 uint32_t color)
{
    lv_obj_t *label = lv_label_create(parent);
    ui_set_font(label);
    lv_label_set_text(label, text);
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(label, width);
    lv_obj_set_pos(label, x, y);
    lv_obj_set_style_text_color(label, lv_color_hex(color), 0);
    lv_obj_set_style_text_letter_space(label, 0, 0);
    return label;
}

static lv_obj_t *ui_create_panel(lv_obj_t *parent,
                                 int32_t x,
                                 int32_t y,
                                 int32_t width,
                                 int32_t height)
{
    lv_obj_t *panel = lv_obj_create(parent);
    lv_obj_set_pos(panel, x, y);
    lv_obj_set_size(panel, width, height);
    ui_style_panel(panel, UI_COLOR_SURFACE, UI_COLOR_BORDER);
    return panel;
}

static void ui_pixel_corners_draw_event_cb(lv_event_t *event)
{
    lv_obj_t *object = lv_event_get_current_target(event);
    lv_layer_t *layer = lv_event_get_layer(event);
    lv_area_t area;
    lv_obj_get_coords(object, &area);
    const uint32_t color = (uint32_t)(uintptr_t)lv_event_get_user_data(event);
    const int32_t arm = 18;
    const int32_t thick = 3;
    const lv_area_t areas[8] = {
        {area.x1, area.y1, area.x1 + arm, area.y1 + thick},
        {area.x1, area.y1, area.x1 + thick, area.y1 + arm},
        {area.x2 - arm, area.y2 - thick, area.x2, area.y2},
        {area.x2 - thick, area.y2 - arm, area.x2, area.y2},
        {area.x2 - arm, area.y1, area.x2, area.y1 + thick},
        {area.x2 - thick, area.y1, area.x2, area.y1 + arm},
        {area.x1, area.y2 - thick, area.x1 + arm, area.y2},
        {area.x1, area.y2 - arm, area.x1 + thick, area.y2},
    };
    lv_draw_rect_dsc_t draw;
    lv_draw_rect_dsc_init(&draw);
    draw.bg_color = lv_color_hex(color);
    draw.bg_opa = LV_OPA_COVER;
    draw.radius = 0;
    for (uint8_t index = 0; index < 8; ++index) {
        lv_draw_rect(layer, &draw, &areas[index]);
    }
}

