ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
static void ui_starfield_draw_event_cb(lv_event_t *event)
{
    lv_obj_t *object = lv_event_get_current_target(event);
    lv_layer_t *layer = lv_event_get_layer(event);
    lv_area_t area;
    lv_obj_get_coords(object, &area);
    lv_draw_rect_dsc_t draw;
    lv_draw_rect_dsc_init(&draw);
    draw.radius = 0;
    for (uint8_t index = 0; index < sizeof(s_star_points) / sizeof(s_star_points[0]); ++index) {
        draw.bg_color = lv_color_hex(s_star_colors[index % 3]);
        draw.bg_opa = index % 4 == 0 ? LV_OPA_COVER : LV_OPA_70;
        const lv_area_t star = {
            area.x1 + s_star_points[index][0], area.y1 + s_star_points[index][1],
            area.x1 + s_star_points[index][0] + s_star_points[index][2],
            area.y1 + s_star_points[index][1] + s_star_points[index][2],
        };
        lv_draw_rect(layer, &draw, &star);
    }
}

static void ui_create_starfield(lv_obj_t *screen)
{
    lv_obj_add_event_cb(screen, ui_starfield_draw_event_cb, LV_EVENT_DRAW_MAIN, NULL);
}

static void ui_add_pixel_corners(lv_obj_t *object, uint32_t color)
{
    lv_obj_add_event_cb(object, ui_pixel_corners_draw_event_cb, LV_EVENT_DRAW_POST,
                        (void *)(uintptr_t)color);
}

static lv_obj_t *ui_create_accent(lv_obj_t *parent,
                                  int32_t x,
                                  int32_t y,
                                  int32_t width,
                                  uint32_t color)
{
    lv_obj_t *accent = lv_obj_create(parent);
    lv_obj_set_pos(accent, x, y);
    lv_obj_set_size(accent, width, 3);
    lv_obj_set_style_bg_color(accent, lv_color_hex(color), 0);
    lv_obj_set_style_bg_opa(accent, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(accent, 0, 0);
    lv_obj_set_style_radius(accent, 2, 0);
    lv_obj_clear_flag(accent, LV_OBJ_FLAG_CLICKABLE);
    return accent;
}

static void ui_create_signal_icon(lv_obj_t *parent,
                                  int32_t x,
                                  int32_t y,
                                  uint32_t color,
                                  uint8_t variant)
{
    lv_obj_t *halo = lv_obj_create(parent);
    lv_obj_set_pos(halo, x, y);
    lv_obj_set_size(halo, 88, 88);
    lv_obj_set_style_bg_color(halo, lv_color_hex(0x0B2028), 0);
    lv_obj_set_style_bg_opa(halo, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(halo, lv_color_hex(color), 0);
    lv_obj_set_style_border_width(halo, 1, 0);
    lv_obj_set_style_radius(halo, LV_RADIUS_CIRCLE, 0);
    lv_obj_clear_flag(halo, LV_OBJ_FLAG_CLICKABLE);

    lv_obj_t *core = lv_obj_create(halo);
    lv_obj_set_size(core, 54, 44);
    lv_obj_center(core);
    lv_obj_set_style_bg_color(core, lv_color_hex(UI_COLOR_SURFACE_ALT), 0);
    lv_obj_set_style_bg_opa(core, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(core, lv_color_hex(color), 0);
    lv_obj_set_style_border_width(core, 2, 0);
    lv_obj_set_style_radius(core, 8, 0);
    lv_obj_clear_flag(core, LV_OBJ_FLAG_CLICKABLE);

    for (uint8_t index = 0; index < 2; ++index) {
        lv_obj_t *eye = lv_obj_create(core);
        lv_obj_set_pos(eye, 12 + index * 25, 11);
        lv_obj_set_size(eye, 7, 8);
        lv_obj_set_style_bg_color(eye, lv_color_hex(index == 0 ? UI_COLOR_CYAN : UI_COLOR_PINK), 0);
        lv_obj_set_style_bg_opa(eye, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(eye, 0, 0);
        lv_obj_set_style_radius(eye, 0, 0);
        lv_obj_clear_flag(eye, LV_OBJ_FLAG_CLICKABLE);
    }
    lv_obj_t *mouth = lv_obj_create(core);
    lv_obj_set_pos(mouth, 17, 29);
    lv_obj_set_size(mouth, 20, 4);
    lv_obj_set_style_bg_color(mouth, lv_color_hex(UI_COLOR_YELLOW), 0);
    lv_obj_set_style_bg_opa(mouth, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(mouth, 0, 0);
    lv_obj_set_style_radius(mouth, 0, 0);
    lv_obj_clear_flag(mouth, LV_OBJ_FLAG_CLICKABLE);

    const int16_t pixels[4][2] = {{7, 17}, {75, 22}, {16, 72}, {67, 68}};
    for (uint8_t index = 0; index < (variant == 0 ? 3 : 4); ++index) {
        lv_obj_t *pixel = lv_obj_create(halo);
        lv_obj_set_pos(pixel, pixels[index][0], pixels[index][1]);
        lv_obj_set_size(pixel, 6, 6);
        lv_obj_set_style_bg_color(pixel, lv_color_hex(index % 2 == 0 ? UI_COLOR_PINK : UI_COLOR_YELLOW), 0);
        lv_obj_set_style_bg_opa(pixel, LV_OPA_COVER, 0);
        lv_obj_set_style_border_width(pixel, 0, 0);
        lv_obj_set_style_radius(pixel, 0, 0);
        lv_obj_clear_flag(pixel, LV_OBJ_FLAG_CLICKABLE);
    }
}

static void ui_back_event_cb(lv_event_t *event)
{
    (void)event;
    if (s_page != UI_PAGE_HOME) {
        audio_self_test_play_effect(AUDIO_EFFECT_BACK);
    }
    if (s_page == UI_PAGE_SHOOTER) {
        ui_exit_shooter_to_campaign();
    } else if (s_page == UI_PAGE_SUCCESS) {
        ui_load_page(UI_PAGE_PLAY);
    } else if (s_page == UI_PAGE_PLAY || s_page == UI_PAGE_DETAIL) {
        ui_load_page(UI_PAGE_CAMPAIGN);
    } else if (s_page != UI_PAGE_HOME) {
        ui_load_page(UI_PAGE_HOME);
    }
}

static void ui_create_header(lv_obj_t *screen, const char *section, const char *title, bool show_back)
{
    lv_obj_t *header = lv_obj_create(screen);
    lv_obj_set_pos(header, 0, 0);
    lv_obj_set_size(header, UI_SCREEN_WIDTH, UI_HEADER_HEIGHT);
    lv_obj_set_style_bg_color(header, lv_color_hex(0x071017), 0);
    lv_obj_set_style_bg_opa(header, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(header, lv_color_hex(UI_COLOR_BORDER), 0);
    lv_obj_set_style_border_width(header, 1, 0);
    lv_obj_set_style_border_side(header, LV_BORDER_SIDE_BOTTOM, 0);
    lv_obj_set_style_radius(header, 0, 0);
    lv_obj_set_style_pad_all(header, 0, 0);
    lv_obj_clear_flag(header, LV_OBJ_FLAG_SCROLLABLE);
    ui_create_accent(header, 0, UI_HEADER_HEIGHT - 3, 220, UI_COLOR_CYAN);

    int32_t title_x = show_back ? 122 : 22;
    if (show_back) {
        lv_obj_t *back = lv_button_create(header);
        lv_obj_set_pos(back, 16, 13);
        lv_obj_set_size(back, 92, 46);
        lv_obj_set_style_bg_color(back, lv_color_hex(UI_COLOR_SURFACE_ALT), 0);
        lv_obj_set_style_bg_opa(back, LV_OPA_COVER, 0);
        lv_obj_set_style_border_color(back, lv_color_hex(UI_COLOR_BORDER), 0);
        lv_obj_set_style_border_width(back, 1, 0);
        lv_obj_set_style_radius(back, 5, 0);
        lv_obj_add_event_cb(back, ui_back_event_cb, LV_EVENT_CLICKED, NULL);
        lv_obj_t *label = lv_label_create(back);
        ui_set_font(label);
        lv_label_set_text(label, "< 返回");
        lv_obj_set_style_text_color(label, lv_color_hex(UI_COLOR_CYAN), 0);
        lv_obj_center(label);
    }

