ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
    lv_obj_t *section_label = ui_create_label(header, section, title_x, 9, 420, UI_COLOR_CYAN);
    lv_obj_set_style_text_font(section_label, &app_ui_font_cn_16, 0);
    lv_obj_t *title_label = ui_create_label(header, title, title_x, 28, 520, UI_COLOR_TEXT);
    lv_obj_set_style_text_font(title_label, &app_ui_font_cn_24, 0);

    lv_obj_t *status_pill = lv_obj_create(header);
    lv_obj_set_pos(status_pill, 836, 20);
    lv_obj_set_size(status_pill, 164, 36);
    lv_obj_set_style_bg_color(status_pill, lv_color_hex(0x0C211C), 0);
    lv_obj_set_style_bg_opa(status_pill, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(status_pill, lv_color_hex(0x276A50), 0);
    lv_obj_set_style_border_width(status_pill, 1, 0);
    lv_obj_set_style_radius(status_pill, 18, 0);
    /* Child coordinates are intentionally measured from the visible pill edge. */
    lv_obj_set_style_pad_all(status_pill, 0, 0);
    lv_obj_clear_flag(status_pill, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_t *status_dot = lv_obj_create(status_pill);
    lv_obj_set_pos(status_dot, 12, 12);
    lv_obj_set_size(status_dot, 10, 10);
    lv_obj_set_style_bg_color(status_dot, lv_color_hex(UI_COLOR_GREEN), 0);
    lv_obj_set_style_bg_opa(status_dot, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(status_dot, 0, 0);
    lv_obj_set_style_radius(status_dot, LV_RADIUS_CIRCLE, 0);
    lv_obj_t *status = ui_create_label(status_pill, "准备好了", 32, 7, 120, UI_COLOR_GREEN);
    lv_obj_set_height(status, 22);
    lv_label_set_long_mode(status, LV_LABEL_LONG_CLIP);
    lv_obj_set_style_text_align(status, LV_TEXT_ALIGN_CENTER, 0);
}

static void ui_style_action_item(lv_obj_t *item, bool selected, bool enabled)
{
    const uint32_t border = selected ? UI_COLOR_CYAN : UI_COLOR_BORDER;
    const uint32_t background = selected ? UI_COLOR_SURFACE_HI : UI_COLOR_SURFACE;
    lv_obj_set_style_bg_color(item, lv_color_hex(background), 0);
    lv_obj_set_style_bg_opa(item, enabled ? LV_OPA_COVER : LV_OPA_80, 0);
    lv_obj_set_style_border_color(item, lv_color_hex(border), 0);
    lv_obj_set_style_border_width(item, selected ? 2 : 1, 0);
    lv_obj_set_style_radius(item, 2, 0);
    lv_obj_set_style_bg_color(item, lv_color_hex(UI_COLOR_CYAN_DIM), LV_STATE_PRESSED);
    lv_obj_set_style_border_color(item, lv_color_hex(UI_COLOR_CYAN), LV_STATE_PRESSED);
}

static lv_obj_t *ui_create_action_item(lv_obj_t *parent,
                                       int32_t x,
                                       int32_t y,
                                       int32_t width,
                                       int32_t height,
                                       const char *index,
                                       const char *title,
                                       const char *meta,
                                       lv_event_cb_t callback,
                                       void *user_data)
{
    lv_obj_t *item = lv_button_create(parent);
    lv_obj_set_pos(item, x, y);
    lv_obj_set_size(item, width, height);
    lv_obj_set_style_pad_all(item, 0, 0);
    ui_style_action_item(item, false, true);
    if (callback != NULL) {
        lv_obj_add_event_cb(item, callback, LV_EVENT_CLICKED, user_data);
    }

    ui_create_label(item, index, 22, 18, 190, UI_COLOR_AMBER);
    const int32_t title_width = height > 220 ? width - 170 : width - 100;
    lv_obj_t *title_label = ui_create_label(item, title, 22, 49, title_width, UI_COLOR_TEXT);
    lv_obj_set_style_text_font(title_label, &app_ui_font_cn_24, 0);
    ui_create_label(item, meta, 22, height - 38, width - 44, UI_COLOR_MUTED);
    ui_create_accent(item, 22, height - 58, width - 88, UI_COLOR_CYAN_DIM);

    if (height > 220) {
        ui_create_signal_icon(item, width - 122, 32, UI_COLOR_CYAN, 0);
    } else {
        lv_obj_t *arrow = ui_create_label(item, ">", width - 54, height / 2 - 16, 32, UI_COLOR_CYAN);
        lv_obj_set_style_text_font(arrow, &lv_font_montserrat_22, 0);
        lv_obj_set_style_text_align(arrow, LV_TEXT_ALIGN_CENTER, 0);
    }
    return item;
}

static void ui_refresh_home_selection(void)
{
    for (uint8_t index = 0; index < UI_HOME_COUNT; ++index) {
        ui_style_action_item(s_ui.home_items[index], index == s_home_selection, true);
    }
}

static void ui_refresh_settings_selection(void)
{
    for (uint8_t index = 0; index < UI_SETTINGS_COUNT; ++index) {
        ui_style_action_item(s_ui.settings_items[index], index == s_settings_selection, true);
    }
    if (s_ui.settings_sync_status != NULL) {
        progress_sync_status_t status;
        progress_sync_get_status(&status);
        const char *text = "按中键上传 16 个关卡记录";
        uint32_t color = UI_COLOR_MUTED;
        switch (status.state) {
        case PROGRESS_SYNC_UPLOADING:
            text = "正在上传云存档...";
            color = UI_COLOR_CYAN;
            break;
        case PROGRESS_SYNC_SUCCEEDED:
            text = "云存档上传成功";
            color = UI_COLOR_GREEN;
            break;
        case PROGRESS_SYNC_NETWORK_UNAVAILABLE:
            text = "网络未连接";
            color = UI_COLOR_DANGER;
            break;
        case PROGRESS_SYNC_CONFIGURATION_ERROR:
            text = "同步密钥未配置";
            color = UI_COLOR_DANGER;
            break;
        case PROGRESS_SYNC_SERVER_REJECTED:
            text = "服务端拒绝上传";
            color = UI_COLOR_DANGER;
            break;
        case PROGRESS_SYNC_FAILED:
            text = "上传失败，请稍后重试";
            color = UI_COLOR_DANGER;
            break;
        case PROGRESS_SYNC_READY:
        default:
            break;
        }
        lv_label_set_text(s_ui.settings_sync_status, text);
        lv_obj_set_style_text_color(s_ui.settings_sync_status, lv_color_hex(color), 0);
        s_last_progress_sync_status = status;
        s_progress_sync_status_initialized = true;
    }
    if (s_ui.settings_unlock_status != NULL) {
        lv_label_set_text(s_ui.settings_unlock_status,
                          s_unlock_all_nodes ? "全部关卡已解锁" :
                          "选中后按中键解锁（仅本次上电）");
        lv_obj_set_style_text_color(
            s_ui.settings_unlock_status,
            lv_color_hex(s_unlock_all_nodes ? UI_COLOR_GREEN : UI_COLOR_MUTED), 0);
    }
    if (s_ui.settings_initialize_status != NULL) {
        lv_label_set_text(s_ui.settings_initialize_status,
                          s_initialize_error ? "初始化失败，请稍后重试" :
                          "按中键清空通关记录");
        lv_obj_set_style_text_color(
            s_ui.settings_initialize_status,
            lv_color_hex(s_initialize_error ? UI_COLOR_DANGER : UI_COLOR_MUTED), 0);
    }
    if (s_ui.settings_assistant_status != NULL) {
        const bool remote = assistant_mode_get() == ASSISTANT_MODE_REMOTE;
        lv_label_set_text(s_ui.settings_assistant_status,
                          remote ? "当前使用后端助教\n按中键切换" :
                          "当前使用内置助教\n按中键切换");
        lv_obj_set_style_text_color(s_ui.settings_assistant_status,
                                    lv_color_hex(remote ? UI_COLOR_GREEN : UI_COLOR_CYAN), 0);
    }
}

static void ui_home_item_event_cb(lv_event_t *event)
{
    const uintptr_t value = (uintptr_t)lv_event_get_user_data(event);
    s_home_selection = (uint8_t)(value - 1U);
    audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
    ui_refresh_home_selection();
    ui_load_page(s_home_selection == UI_HOME_CAMPAIGN ? UI_PAGE_CAMPAIGN : UI_PAGE_SETTINGS);
}

static void ui_settings_item_event_cb(lv_event_t *event)
{
    const uintptr_t value = (uintptr_t)lv_event_get_user_data(event);
    s_settings_selection = (uint8_t)(value - 1U);
    audio_self_test_play_effect(AUDIO_EFFECT_SELECT);
    ui_refresh_settings_selection();
    audio_self_test_set_tone_enabled(false);
}

static void ui_create_home_screen(void)
{
    lv_obj_t *screen = lv_obj_create(NULL);
    s_ui.screen[UI_PAGE_HOME] = screen;
    ui_style_screen(screen);
    ui_create_starfield(screen);
    ui_create_header(screen, "图灵号", "关卡游玩", false);

