ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
    ui_create_label(screen, "选择你的冒险", 30, 102, 480, UI_COLOR_CYAN);
    lv_obj_t *headline = ui_create_label(screen, "小飞船要出发啦！", 30, 132, 520, UI_COLOR_TEXT);
    lv_obj_set_style_text_font(headline, &app_ui_font_cn_24, 0);
    ui_create_label(screen, "请选择你想去的地方", 30, 166, 800, UI_COLOR_MUTED);
    ui_create_accent(screen, 30, 194, 964, UI_COLOR_BORDER);

    s_ui.home_items[UI_HOME_CAMPAIGN] = ui_create_action_item(
        screen, 30, 220, 466, 294, "第一站", "关卡游玩", "去星际地图闯关",
        ui_home_item_event_cb, (void *)(uintptr_t)(UI_HOME_CAMPAIGN + 1U));
    s_ui.home_items[UI_HOME_SETTINGS] = ui_create_action_item(
        screen, 528, 220, 466, 294, "第二站", "设置", "看看小飞船的状态",
        ui_home_item_event_cb, (void *)(uintptr_t)(UI_HOME_SETTINGS + 1U));
    ui_add_pixel_corners(s_ui.home_items[UI_HOME_CAMPAIGN], UI_COLOR_CYAN);
    ui_add_pixel_corners(s_ui.home_items[UI_HOME_SETTINGS], UI_COLOR_PINK);

    ui_create_label(screen, "用摇杆选择，按中间键进入", 30, 556, 500, UI_COLOR_MUTED);
    ui_refresh_home_selection();
}

static int32_t ui_positive_mod(int32_t value, int32_t divisor)
{
    int32_t result = value % divisor;
    return result < 0 ? result + divisor : result;
}

static void ui_map_draw_event_cb(lv_event_t *event)
{
    lv_obj_t *map = lv_event_get_current_target(event);
    lv_layer_t *layer = lv_event_get_layer(event);
    lv_area_t area;
    lv_obj_get_coords(map, &area);

    lv_draw_line_dsc_t grid;
    lv_draw_line_dsc_init(&grid);
    grid.color = lv_color_hex(UI_COLOR_GRID);
    grid.width = 1;
    grid.opa = LV_OPA_60;

    const int32_t grid_x = ui_positive_mod(s_map_offset_x, UI_MAP_GRID_SIZE);
    const int32_t grid_y = ui_positive_mod(s_map_offset_y, UI_MAP_GRID_SIZE);
    for (int32_t x = grid_x; x < UI_MAP_WIDTH; x += UI_MAP_GRID_SIZE) {
        grid.p1 = (lv_point_precise_t) {.x = area.x1 + x, .y = area.y1};
        grid.p2 = (lv_point_precise_t) {.x = area.x1 + x, .y = area.y2};
        lv_draw_line(layer, &grid);
    }
    for (int32_t y = grid_y; y < UI_MAP_HEIGHT; y += UI_MAP_GRID_SIZE) {
        grid.p1 = (lv_point_precise_t) {.x = area.x1, .y = area.y1 + y};
        grid.p2 = (lv_point_precise_t) {.x = area.x2, .y = area.y1 + y};
        lv_draw_line(layer, &grid);
    }

    const campaign_node_t *nodes = ui_nodes();
    for (uint16_t child = 0; child < s_node_count; ++child) {
        for (uint8_t prerequisite = 0; prerequisite < nodes[child].prerequisite_count; ++prerequisite) {
            uint16_t parent = 0;
            while (parent < s_node_count &&
                   nodes[parent].id != nodes[child].prerequisite_ids[prerequisite]) {
                ++parent;
            }
            if (parent == s_node_count) {
                continue;
            }
            lv_draw_line_dsc_t route;
            lv_draw_line_dsc_init(&route);
            const bool active = child == s_selected_node || parent == s_selected_node;
            route.color = lv_color_hex(active ? UI_COLOR_AMBER : UI_COLOR_CYAN_DIM);
            route.width = active ? 3 : 2;
            route.opa = active ? LV_OPA_COVER : LV_OPA_70;
            route.round_start = 1;
            route.round_end = 1;
            route.p1 = (lv_point_precise_t) {
                .x = area.x1 + nodes[parent].x + s_map_offset_x,
                .y = area.y1 + nodes[parent].y + s_map_offset_y,
            };
            route.p2 = (lv_point_precise_t) {
                .x = area.x1 + nodes[child].x + s_map_offset_x,
                .y = area.y1 + nodes[child].y + s_map_offset_y,
            };
            lv_draw_line(layer, &route);
        }
    }
}

static void ui_style_map_node(uint16_t index)
{
    const campaign_node_t *content = &ui_nodes()[index];
    const bool selected = index == s_selected_node;
    const bool reward = content->kind == CAMPAIGN_NODE_KIND_REWARD;
    const bool completed = s_completed_nodes[index];
    const bool unlocked = ui_node_is_unlocked(index);
    lv_obj_t *node = s_ui.map_nodes[index];
    const uint32_t background = !unlocked ? 0x080D15 :
                                (reward ? (selected ? 0x4A2949 : 0x241A35) :
                                 (selected ? 0x16434B : 0x0A171E));
    const uint32_t border = completed ? UI_COLOR_GREEN :
                            (!unlocked ? UI_COLOR_BORDER :
                             (reward ? (selected ? UI_COLOR_YELLOW : UI_COLOR_PINK) :
                              (selected ? UI_COLOR_AMBER : UI_COLOR_CYAN_DIM)));
    lv_obj_set_style_bg_color(node, lv_color_hex(background), 0);
    lv_obj_set_style_bg_opa(node, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(node, lv_color_hex(border), 0);
    lv_obj_set_style_border_width(node, completed ? 3 :
                                  (reward ? (selected ? 4 : 2) : (selected ? 3 : 1)), 0);
    lv_obj_set_style_radius(node, reward ? 4 : 14, 0);
    lv_obj_set_style_outline_color(node, lv_color_hex(reward ? UI_COLOR_PINK : UI_COLOR_CYAN_DIM), 0);
    lv_obj_set_style_outline_width(node, reward && unlocked ? 1 : 0, 0);
    lv_obj_set_style_outline_pad(node, reward && unlocked ? 3 : 0, 0);
    lv_obj_set_style_text_color(s_ui.map_node_ids[index],
                                lv_color_hex(!unlocked ? UI_COLOR_MUTED :
                                             (reward ? (selected ? UI_COLOR_YELLOW : UI_COLOR_PINK) :
                                              (selected ? UI_COLOR_AMBER : UI_COLOR_CYAN))), 0);
    lv_obj_set_style_text_color(s_ui.map_node_titles[index],
                                lv_color_hex(!unlocked ? UI_COLOR_MUTED :
                                             (reward ? UI_COLOR_YELLOW : UI_COLOR_TEXT)), 0);
}

static void ui_refresh_campaign_summary(void)
{
    const campaign_node_t *node = &ui_nodes()[s_selected_node];
    const lv_font_t *summary_font = node->kind == CAMPAIGN_NODE_KIND_REWARD ?
        &shooter_font_cn_16 : &app_ui_font_cn_16;
    if (node->kind == CAMPAIGN_NODE_KIND_REWARD) {
        lv_label_set_text(s_ui.campaign_code, "特别关卡");
    } else {
        lv_label_set_text_fmt(s_ui.campaign_code, "第 %03u 关", node->id);
    }
    lv_label_set_text(s_ui.campaign_title, node->title);
    lv_obj_set_style_text_font(s_ui.campaign_title,
                               node->kind == CAMPAIGN_NODE_KIND_REWARD ?
                                   &shooter_font_cn_16 : &app_ui_font_cn_24, 0);
    const char *encounter = strstr(node->goal, "【遭遇事件】");
    const char *challenge = strstr(node->goal, "【晶体挑战】");
    const char *action = strstr(node->goal, "【行动】");
    size_t summary_length = 0;

    /* The map summary is intentionally shorter; the detail page keeps node->goal intact. */
    if (encounter != NULL) {
        const char *encounter_end = challenge != NULL && challenge > encounter ? challenge : action;
        if (encounter_end == NULL || encounter_end < encounter) {
            encounter_end = node->goal + strlen(node->goal);
        }
        summary_length = (size_t)(encounter_end - encounter);
        if (summary_length >= sizeof(s_campaign_summary)) {
            summary_length = sizeof(s_campaign_summary) - 1U;
        }
        memcpy(s_campaign_summary, encounter, summary_length);
    }

