ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
    if (action != NULL && summary_length < sizeof(s_campaign_summary) - 1U) {
        if (summary_length > 0U && s_campaign_summary[summary_length - 1U] != '\n') {
            s_campaign_summary[summary_length++] = '\n';
        }
        size_t action_length = strlen(action);
        const size_t remaining = sizeof(s_campaign_summary) - 1U - summary_length;
        if (action_length > remaining) {
            action_length = remaining;
        }
        memcpy(s_campaign_summary + summary_length, action, action_length);
        summary_length += action_length;
    }
    s_campaign_summary[summary_length] = '\0';
    lv_label_set_text(s_ui.campaign_goal, s_campaign_summary);
    lv_obj_set_style_text_font(s_ui.campaign_goal, summary_font, 0);
    lv_label_set_text(s_ui.campaign_gate_reward, node->gate_reward);
    lv_label_set_text(s_ui.campaign_ship_reward, node->ship_reward);
    lv_obj_set_style_text_font(s_ui.campaign_gate_reward, summary_font, 0);
    lv_obj_set_style_text_font(s_ui.campaign_ship_reward, summary_font, 0);
    if (node->gate_reward[0] != '\0') {
        lv_obj_remove_flag(s_ui.campaign_gate_reward, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(s_ui.campaign_gate_reward, LV_OBJ_FLAG_HIDDEN);
    }
    if (node->ship_reward[0] != '\0') {
        lv_obj_set_y(s_ui.campaign_ship_reward, node->gate_reward[0] != '\0' ? 400 : 372);
        lv_obj_remove_flag(s_ui.campaign_ship_reward, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(s_ui.campaign_ship_reward, LV_OBJ_FLAG_HIDDEN);
    }
}

static void ui_refresh_campaign(void)
{
    const campaign_node_t *nodes = ui_nodes();
    s_map_offset_x = UI_MAP_WIDTH / 2 - nodes[s_selected_node].x;
    s_map_offset_y = UI_MAP_HEIGHT / 2 - nodes[s_selected_node].y;

    for (uint16_t index = 0; index < s_node_count; ++index) {
        const int32_t x = nodes[index].x + s_map_offset_x - UI_NODE_WIDTH / 2;
        const int32_t y = nodes[index].y + s_map_offset_y - UI_NODE_HEIGHT / 2;
        const bool visible = x + UI_NODE_WIDTH >= 0 && x < UI_MAP_WIDTH &&
                             y + UI_NODE_HEIGHT >= 0 && y < UI_MAP_HEIGHT;
        lv_obj_set_pos(s_ui.map_nodes[index], x, y);
        if (visible) {
            lv_obj_remove_flag(s_ui.map_nodes[index], LV_OBJ_FLAG_HIDDEN);
        } else {
            lv_obj_add_flag(s_ui.map_nodes[index], LV_OBJ_FLAG_HIDDEN);
        }
        ui_style_map_node(index);
    }
    ui_refresh_campaign_summary();
    lv_obj_invalidate(s_ui.map);
}

static void ui_map_node_event_cb(lv_event_t *event)
{
    const uintptr_t value = (uintptr_t)lv_event_get_user_data(event);
    const uint16_t index = (uint16_t)(value - 1U);
    if (index >= s_node_count) {
        return;
    }
    s_selected_node = index;
    audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
    ui_refresh_campaign();
    ui_load_page(UI_PAGE_DETAIL);
}

static void ui_campaign_detail_event_cb(lv_event_t *event)
{
    (void)event;
    audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
    ui_load_page(UI_PAGE_DETAIL);
}

static void ui_create_campaign_screen(void)
{
    lv_obj_t *screen = lv_obj_create(NULL);
    s_ui.screen[UI_PAGE_CAMPAIGN] = screen;
    ui_style_screen(screen);
    ui_create_starfield(screen);
    ui_create_header(screen, "星际冒险", "关卡航线", true);

    s_ui.map = ui_create_panel(screen, UI_MAP_X, UI_MAP_Y, UI_MAP_WIDTH, UI_MAP_HEIGHT);
    ui_add_pixel_corners(s_ui.map, UI_COLOR_CYAN);
    lv_obj_add_event_cb(s_ui.map, ui_map_draw_event_cb, LV_EVENT_DRAW_MAIN, NULL);
    lv_obj_clear_flag(s_ui.map, LV_OBJ_FLAG_SCROLLABLE);
    ui_create_label(s_ui.map, "星际地图", 18, 12, 180, UI_COLOR_CYAN);
    ui_create_label(s_ui.map, "初始门电路：输入、输出", 184, 12, 320, UI_COLOR_MUTED);

    const campaign_node_t *nodes = campaign_content_nodes(&s_node_count);
    if (s_node_count > UI_MAX_NODES) {
        s_node_count = UI_MAX_NODES;
    }
    for (uint16_t index = 0; index < s_node_count; ++index) {
        lv_obj_t *node = lv_button_create(s_ui.map);
        s_ui.map_nodes[index] = node;
        lv_obj_set_size(node, UI_NODE_WIDTH, UI_NODE_HEIGHT);
        lv_obj_set_style_pad_all(node, 0, 0);
        lv_obj_set_style_radius(node, 14, 0);
        lv_obj_clear_flag(node, LV_OBJ_FLAG_SCROLLABLE);
        lv_obj_add_event_cb(node, ui_map_node_event_cb, LV_EVENT_CLICKED,
                            (void *)(uintptr_t)(index + 1U));

        s_ui.map_node_ids[index] = ui_create_label(node, "", 10, 7, UI_NODE_WIDTH - 20, UI_COLOR_CYAN);
        if (nodes[index].kind == CAMPAIGN_NODE_KIND_REWARD) {
            lv_label_set_text(s_ui.map_node_ids[index], "特别关卡");
            ui_add_pixel_corners(node, UI_COLOR_PINK);
        } else {
            lv_label_set_text_fmt(s_ui.map_node_ids[index], "第 %03u 关", nodes[index].id);
        }
        s_ui.map_node_titles[index] = ui_create_label(
            node, nodes[index].title, 10, 33, UI_NODE_WIDTH - 20, UI_COLOR_TEXT);
        if (nodes[index].kind == CAMPAIGN_NODE_KIND_REWARD) {
            lv_obj_set_style_text_font(s_ui.map_node_titles[index], &shooter_font_cn_16, 0);
        }
        lv_obj_set_style_text_align(s_ui.map_node_titles[index], LV_TEXT_ALIGN_CENTER, 0);
    }

    lv_obj_t *side = ui_create_panel(screen, 758, UI_MAP_Y, 248, UI_MAP_HEIGHT);
    ui_add_pixel_corners(side, UI_COLOR_PINK);
    ui_create_label(side, "当前选择", 18, 18, 212, UI_COLOR_CYAN);
    s_ui.campaign_code = ui_create_label(side, "", 18, 45, 212, UI_COLOR_AMBER);
    s_ui.campaign_title = ui_create_label(side, "", 18, 76, 212, UI_COLOR_TEXT);
    lv_obj_set_style_text_font(s_ui.campaign_title, &app_ui_font_cn_24, 0);
    s_ui.campaign_goal = ui_create_label(side, "", 18, 122, 212, UI_COLOR_MUTED);
    lv_obj_set_height(s_ui.campaign_goal, 226);
    ui_create_accent(side, 18, 356, 212, UI_COLOR_CYAN_DIM);
    s_ui.campaign_gate_reward = ui_create_label(side, "", 18, 372, 212, UI_COLOR_CYAN);
    lv_obj_set_height(s_ui.campaign_gate_reward, 24);
    s_ui.campaign_ship_reward = ui_create_label(side, "", 18, 400, 212, UI_COLOR_PINK);
    lv_obj_set_height(s_ui.campaign_ship_reward, 24);

    lv_obj_t *open = lv_button_create(side);
    lv_obj_set_pos(open, 18, 442);
    lv_obj_set_size(open, 212, 42);
    ui_style_action_item(open, true, true);
    lv_obj_add_event_cb(open, ui_campaign_detail_event_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *open_label = lv_label_create(open);
    ui_set_font(open_label);
    lv_label_set_text(open_label, "查看任务  >");
    lv_obj_set_style_text_color(open_label, lv_color_hex(UI_COLOR_TEXT), 0);
    lv_obj_center(open_label);
}

static void ui_refresh_detail(void)
{
    const campaign_node_t *node = &ui_nodes()[s_selected_node];
    const bool completed = s_completed_nodes[s_selected_node];
    const bool unlocked = ui_node_is_unlocked(s_selected_node);
    if (node->kind == CAMPAIGN_NODE_KIND_REWARD) {
        lv_label_set_text(s_ui.detail_code, completed ? "特别关卡  已完成" :
                          (unlocked ? "特别关卡  可以进入" : "特别关卡  未解锁"));
    } else {
        lv_label_set_text_fmt(s_ui.detail_code, completed ? "第 %03u 关  已完成" :
                              (unlocked ? "第 %03u 关  可以进入" : "第 %03u 关  未解锁"),
                              node->id);
    }
    lv_label_set_text(s_ui.detail_title, node->title);
    lv_label_set_text(s_ui.detail_story, node->goal);
    lv_label_set_text(s_ui.detail_gate_reward, node->gate_reward);
    lv_label_set_text(s_ui.detail_ship_reward, node->ship_reward);
    const lv_font_t *detail_font = node->kind == CAMPAIGN_NODE_KIND_REWARD ?
        &shooter_font_cn_16 : &app_ui_font_cn_16;
    lv_obj_set_style_text_font(s_ui.detail_title,
                               node->kind == CAMPAIGN_NODE_KIND_REWARD ?
                                   &shooter_font_cn_16 : &app_ui_font_cn_24, 0);
    lv_obj_set_style_text_font(s_ui.detail_story, detail_font, 0);
    lv_obj_set_style_text_font(s_ui.detail_gate_reward, detail_font, 0);
    lv_obj_set_style_text_font(s_ui.detail_ship_reward, detail_font, 0);
    const uint32_t status_color = completed || unlocked ? UI_COLOR_GREEN : UI_COLOR_PINK;
    lv_obj_set_style_bg_color(s_ui.detail_availability,
                              lv_color_hex(completed || unlocked ? 0x0C211C : 0x241A35), 0);
    lv_obj_set_style_border_color(s_ui.detail_availability, lv_color_hex(status_color), 0);
    lv_obj_set_style_bg_color(s_ui.detail_availability_dot, lv_color_hex(status_color), 0);
    lv_label_set_text(s_ui.detail_availability_label,
                      completed ? "已完成" : (unlocked ? "可进入" : "未解锁"));
    lv_obj_set_style_text_color(s_ui.detail_availability_label, lv_color_hex(status_color), 0);
    if (node->gate_reward[0] != '\0') {
        lv_obj_remove_flag(s_ui.detail_gate_reward, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(s_ui.detail_gate_reward, LV_OBJ_FLAG_HIDDEN);
    }
    if (node->ship_reward[0] != '\0') {
        lv_obj_set_y(s_ui.detail_ship_reward, node->gate_reward[0] != '\0' ? 252 : 216);
        lv_obj_remove_flag(s_ui.detail_ship_reward, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(s_ui.detail_ship_reward, LV_OBJ_FLAG_HIDDEN);
    }
    if (s_ui.detail_start != NULL) {
        if (unlocked) {
            lv_obj_remove_flag(s_ui.detail_start, LV_OBJ_FLAG_HIDDEN);
        } else {
            lv_obj_add_flag(s_ui.detail_start, LV_OBJ_FLAG_HIDDEN);
        }
        if (s_ui.detail_start_label != NULL) {
            lv_label_set_text(s_ui.detail_start_label,
                              node->kind == CAMPAIGN_NODE_KIND_REWARD ?
                                  "开始飞行  >" : "开始组装  >");
        }
    }
    lv_obj_scroll_to_y(lv_obj_get_parent(s_ui.detail_story), 0, LV_ANIM_OFF);
}

static uint32_t ui_reward_stage_id(uint16_t node_id)
{
    switch (node_id) {
    case 150: return 1U;
    case 250: return 2U;
    case 350: return 3U;
    case 450: return 4U;
    case 550: return 5U;
    case 650: return 6U;
    default: return 0U;
    }
}

static void ui_shooter_completed(uint32_t stage_id, void *context)
{
    const uintptr_t encoded_index = (uintptr_t)context;
    if (stage_id < 1U || stage_id > 6U || encoded_index == 0U) return;
    const uint16_t index = (uint16_t)(encoded_index - 1U);
    if (index >= s_node_count) return;
    ui_record_node_completion(index);
    ui_refresh_campaign();
    ESP_LOGI(TAG, "special stage %u completed at campaign node %u",
             (unsigned)stage_id, (unsigned)ui_nodes()[index].id);
}

static void ui_shooter_exit_requested(void *context)
{
    (void)context;
    ui_exit_shooter_to_campaign();
}

static void ui_enter_shooter(uint32_t stage_id)
{
    lv_obj_t *screen = shooter_game_create(
        stage_id, ui_shooter_completed, ui_shooter_exit_requested,
        (void *)(uintptr_t)(s_selected_node + 1U));
    if (screen == NULL) {
        ESP_LOGE(TAG, "failed to create special stage %u", (unsigned)stage_id);
        return;
    }
    s_page = UI_PAGE_SHOOTER;
    lv_screen_load(screen);
}

