ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
static void ui_exit_shooter_to_campaign(void)
{
    lv_obj_t *old_screen = shooter_game_stop();
    ui_load_page(UI_PAGE_CAMPAIGN);
    if (old_screen != NULL) {
        lv_obj_delete_async(old_screen);
    }
}

static void ui_start_play(void)
{
    const campaign_node_t *node = &ui_nodes()[s_selected_node];
    if (!ui_node_is_unlocked(s_selected_node)) {
        audio_self_test_play_effect(AUDIO_EFFECT_ERROR);
        ESP_LOGW(TAG, "campaign node %u is still locked", (unsigned)node->id);
        return;
    }
    audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
    if (node->kind == CAMPAIGN_NODE_KIND_STANDARD && level_rule_get(node->id) != NULL) {
        ui_load_page(UI_PAGE_PLAY);
    } else if (node->kind == CAMPAIGN_NODE_KIND_REWARD) {
        const uint32_t stage_id = ui_reward_stage_id(node->id);
        if (stage_id != 0U) ui_enter_shooter(stage_id);
    }
}

static void ui_start_play_event_cb(lv_event_t *event)
{
    (void)event;
    ui_start_play();
}

static void ui_create_detail_screen(void)
{
    lv_obj_t *screen = lv_obj_create(NULL);
    s_ui.screen[UI_PAGE_DETAIL] = screen;
    ui_style_screen(screen);
    ui_create_starfield(screen);
    ui_create_header(screen, "星际冒险", "关卡详情", true);

    lv_obj_t *story_panel = ui_create_panel(screen, 18, 90, 660, 492);
    ui_add_pixel_corners(story_panel, UI_COLOR_CYAN);
    ui_create_accent(story_panel, 0, 0, 180, UI_COLOR_AMBER);
    s_ui.detail_code = ui_create_label(story_panel, "", 22, 18, 610, UI_COLOR_AMBER);
    s_ui.detail_title = ui_create_label(story_panel, "", 22, 50, 610, UI_COLOR_TEXT);
    lv_obj_set_style_text_font(s_ui.detail_title, &app_ui_font_cn_24, 0);
    ui_create_accent(story_panel, 22, 80, 610, UI_COLOR_BORDER);

    lv_obj_t *story_scroll = lv_obj_create(story_panel);
    lv_obj_set_pos(story_scroll, 18, 98);
    lv_obj_set_size(story_scroll, 624, 372);
    lv_obj_set_style_bg_color(story_scroll, lv_color_hex(0x071016), 0);
    lv_obj_set_style_bg_opa(story_scroll, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(story_scroll, 0, 0);
    lv_obj_set_style_radius(story_scroll, 6, 0);
    lv_obj_set_style_pad_all(story_scroll, 18, 0);
    lv_obj_set_scroll_dir(story_scroll, LV_DIR_VER);
    lv_obj_set_scrollbar_mode(story_scroll, LV_SCROLLBAR_MODE_ACTIVE);
    lv_obj_set_style_bg_color(story_scroll, lv_color_hex(UI_COLOR_CYAN_DIM), LV_PART_SCROLLBAR);
    lv_obj_set_style_bg_opa(story_scroll, LV_OPA_COVER, LV_PART_SCROLLBAR);
    s_ui.detail_story = ui_create_label(story_scroll, "", 0, 0, 570, UI_COLOR_TEXT);
    lv_obj_set_height(s_ui.detail_story, LV_SIZE_CONTENT);

    lv_obj_t *telemetry = ui_create_panel(screen, 694, 90, 312, 492);
    ui_add_pixel_corners(telemetry, UI_COLOR_YELLOW);
    ui_create_accent(telemetry, 0, 0, 120, UI_COLOR_CYAN);
    ui_create_label(telemetry, "任务状态", 20, 20, 272, UI_COLOR_CYAN);
    s_ui.detail_availability = lv_obj_create(telemetry);
    lv_obj_set_pos(s_ui.detail_availability, 20, 51);
    lv_obj_set_size(s_ui.detail_availability, 122, 34);
    lv_obj_set_style_bg_color(s_ui.detail_availability, lv_color_hex(0x0C211C), 0);
    lv_obj_set_style_bg_opa(s_ui.detail_availability, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(s_ui.detail_availability, lv_color_hex(0x276A50), 0);
    lv_obj_set_style_border_width(s_ui.detail_availability, 1, 0);
    lv_obj_set_style_radius(s_ui.detail_availability, 17, 0);
    /* Align the status dot and text to the visible capsule bounds. */
    lv_obj_set_style_pad_all(s_ui.detail_availability, 0, 0);
    lv_obj_clear_flag(s_ui.detail_availability, LV_OBJ_FLAG_CLICKABLE);
    s_ui.detail_availability_dot = lv_obj_create(s_ui.detail_availability);
    lv_obj_set_pos(s_ui.detail_availability_dot, 13, 12);
    lv_obj_set_size(s_ui.detail_availability_dot, 9, 9);
    lv_obj_set_style_bg_color(s_ui.detail_availability_dot, lv_color_hex(UI_COLOR_GREEN), 0);
    lv_obj_set_style_bg_opa(s_ui.detail_availability_dot, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(s_ui.detail_availability_dot, 0, 0);
    lv_obj_set_style_radius(s_ui.detail_availability_dot, LV_RADIUS_CIRCLE, 0);
    s_ui.detail_availability_label = ui_create_label(
        s_ui.detail_availability, "可进入", 31, 6, 76, UI_COLOR_GREEN);
    ui_create_label(telemetry, "任务目标", 20, 116, 272, UI_COLOR_CYAN);
    ui_create_label(telemetry, "完成这个任务，继续前进", 20, 148, 272, UI_COLOR_MUTED);
    ui_create_accent(telemetry, 20, 188, 272, UI_COLOR_BORDER);
    s_ui.detail_gate_reward = ui_create_label(telemetry, "", 20, 216, 272, UI_COLOR_CYAN);
    s_ui.detail_ship_reward = ui_create_label(telemetry, "", 20, 252, 272, UI_COLOR_PINK);

    s_ui.detail_start = lv_button_create(telemetry);
    lv_obj_set_pos(s_ui.detail_start, 20, 350);
    lv_obj_set_size(s_ui.detail_start, 272, 44);
    ui_style_action_item(s_ui.detail_start, true, true);
    lv_obj_add_event_cb(s_ui.detail_start, ui_start_play_event_cb, LV_EVENT_CLICKED, NULL);
    s_ui.detail_start_label = lv_label_create(s_ui.detail_start);
    ui_set_font(s_ui.detail_start_label);
    lv_label_set_text(s_ui.detail_start_label, "开始组装  >");
    lv_obj_set_style_text_color(s_ui.detail_start_label, lv_color_hex(UI_COLOR_TEXT), 0);
    lv_obj_center(s_ui.detail_start_label);

    ui_create_accent(telemetry, 20, 405, 272, UI_COLOR_AMBER);
    ui_create_label(telemetry, "图灵号逻辑实验室", 20, 427, 272, UI_COLOR_AMBER);
}

static const char *ui_gate_name(ssd1315_gate_t gate)
{
    static const char *names[] = {
        "输入", "输出", "非门", "与门", "或门", "与非", "或非", "异或", "同或", "未知",
    };
    return gate <= SSD1315_GATE_NULL ? names[gate] : names[SSD1315_GATE_NULL];
}

static void ui_draw_text(lv_layer_t *layer,
                         const char *text,
                         const lv_font_t *font,
                         uint32_t color,
                         const lv_area_t *area,
                         lv_text_align_t align)
{
    lv_draw_label_dsc_t draw;
    lv_draw_label_dsc_init(&draw);
    draw.text = text;
    draw.text_static = 1;
    draw.font = font;
    draw.color = lv_color_hex(color);
    draw.opa = LV_OPA_COVER;
    draw.align = align;
    draw.text_size.x = lv_area_get_width(area);
    draw.text_size.y = lv_area_get_height(area);
    lv_draw_label(layer, &draw, area);
}

static void ui_draw_line_segment(lv_layer_t *layer,
                                 int32_t x1,
                                 int32_t y1,
                                 int32_t x2,
                                 int32_t y2,
                                 uint32_t color,
                                 int32_t width,
                                 bool dashed)
{
    lv_draw_line_dsc_t line;
    lv_draw_line_dsc_init(&line);
    line.p1 = (lv_point_precise_t) {.x = x1, .y = y1};
    line.p2 = (lv_point_precise_t) {.x = x2, .y = y2};
    line.color = lv_color_hex(color);
    line.width = width;
    line.opa = LV_OPA_COVER;
    line.round_start = 1;
    line.round_end = 1;
    if (dashed) {
        line.dash_width = 7;
        line.dash_gap = 5;
    }
    lv_draw_line(layer, &line);
}

static void ui_draw_routed_link(lv_layer_t *layer,
                                const lv_area_t *parent,
                                const circuit_layout_route_t *route,
                                uint32_t color,
                                bool invalid)
{
    const uint32_t underlay = 0x071016;
    const int32_t under_width = 7;
    const int32_t color_width = invalid ? 4 : 3;
    for (uint8_t index = 0; index + 1U < route->point_count; ++index) {
        ui_draw_line_segment(layer,
                             parent->x1 + route->x[index], parent->y1 + route->y[index],
                             parent->x1 + route->x[index + 1U],
                             parent->y1 + route->y[index + 1U],
                             underlay, under_width, false);
    }
    for (uint8_t index = 0; index + 1U < route->point_count; ++index) {
        ui_draw_line_segment(layer,
                             parent->x1 + route->x[index], parent->y1 + route->y[index],
                             parent->x1 + route->x[index + 1U],
                             parent->y1 + route->y[index + 1U],
                             color, color_width, invalid);
    }
}

static void ui_draw_gate_symbol(lv_layer_t *layer,
                                const circuit_layout_node_t *node,
                                const lv_area_t *parent,
                                ssd1315_gate_t gate)
{
    const int32_t cx = parent->x1 + node->x + node->width / 2;
    const int32_t cy = parent->y1 + node->y + node->height / 2 + 8;
    const uint32_t color = gate == SSD1315_GATE_NULL ? UI_COLOR_DANGER : UI_COLOR_YELLOW;
    if (gate == SSD1315_GATE_INPUT) {
        ui_draw_line_segment(layer, cx - 15, cy, cx + 14, cy, color, 3, false);
        ui_draw_line_segment(layer, cx + 14, cy, cx + 6, cy - 7, color, 3, false);
        ui_draw_line_segment(layer, cx + 14, cy, cx + 6, cy + 7, color, 3, false);
    } else if (gate == SSD1315_GATE_OUTPUT) {
        lv_draw_rect_dsc_t lamp;
        lv_draw_rect_dsc_init(&lamp);
        lamp.bg_opa = LV_OPA_TRANSP;
        lamp.border_color = lv_color_hex(color);
        lamp.border_width = 3;
        lamp.radius = LV_RADIUS_CIRCLE;
        const lv_area_t lamp_area = {cx - 11, cy - 11, cx + 11, cy + 11};
        lv_draw_rect(layer, &lamp, &lamp_area);
    } else if (gate == SSD1315_GATE_NOT) {
        ui_draw_line_segment(layer, cx - 14, cy - 11, cx - 14, cy + 11, color, 3, false);
        ui_draw_line_segment(layer, cx - 14, cy - 11, cx + 8, cy, color, 3, false);
        ui_draw_line_segment(layer, cx + 8, cy, cx - 14, cy + 11, color, 3, false);
        lv_draw_rect_dsc_t bubble;
        lv_draw_rect_dsc_init(&bubble);
        bubble.bg_color = lv_color_hex(UI_COLOR_SURFACE_ALT);
        bubble.bg_opa = LV_OPA_COVER;
        bubble.border_color = lv_color_hex(color);
        bubble.border_width = 2;
        bubble.radius = LV_RADIUS_CIRCLE;
        const lv_area_t bubble_area = {cx + 8, cy - 4, cx + 16, cy + 4};
        lv_draw_rect(layer, &bubble, &bubble_area);
    } else {
        ui_draw_line_segment(layer, cx - 15, cy, cx, cy - 11, color, 2, false);
        ui_draw_line_segment(layer, cx, cy - 11, cx + 15, cy, color, 2, false);
        ui_draw_line_segment(layer, cx + 15, cy, cx, cy + 11, color, 2, false);
        ui_draw_line_segment(layer, cx, cy + 11, cx - 15, cy, color, 2, false);
        if (gate == SSD1315_GATE_NAND || gate == SSD1315_GATE_NOR || gate == SSD1315_GATE_XNOR) {
            lv_draw_rect_dsc_t bubble;
            lv_draw_rect_dsc_init(&bubble);
            bubble.bg_color = lv_color_hex(UI_COLOR_SURFACE_ALT);
            bubble.bg_opa = LV_OPA_COVER;
            bubble.border_color = lv_color_hex(color);
            bubble.border_width = 2;
            bubble.radius = LV_RADIUS_CIRCLE;
            const lv_area_t bubble_area = {cx + 13, cy - 4, cx + 21, cy + 4};
            lv_draw_rect(layer, &bubble, &bubble_area);
        }
        if (gate == SSD1315_GATE_XOR || gate == SSD1315_GATE_XNOR) {
            ui_draw_line_segment(layer, cx - 19, cy - 8, cx - 19, cy + 8, color, 2, false);
        }
    }
}

static void ui_circuit_draw_event_cb(lv_event_t *event)
{
    lv_obj_t *circuit = lv_event_get_current_target(event);
    lv_layer_t *layer = lv_event_get_layer(event);
    lv_area_t area;
    lv_obj_get_coords(circuit, &area);

