ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
    lv_draw_line_dsc_t grid;
    lv_draw_line_dsc_init(&grid);
    grid.color = lv_color_hex(UI_COLOR_GRID);
    grid.width = 1;
    grid.opa = LV_OPA_40;
    for (int32_t x = area.x1 + 28; x < area.x2; x += 56) {
        grid.p1 = (lv_point_precise_t) {.x = x, .y = area.y1};
        grid.p2 = (lv_point_precise_t) {.x = x, .y = area.y2};
        lv_draw_line(layer, &grid);
    }
    for (int32_t y = area.y1 + 28; y < area.y2; y += 56) {
        grid.p1 = (lv_point_precise_t) {.x = area.x1, .y = y};
        grid.p2 = (lv_point_precise_t) {.x = area.x2, .y = y};
        lv_draw_line(layer, &grid);
    }

    for (uint8_t index = 0; index < s_play_snapshot.link_count; ++index) {
        const board_link_t *link = &s_play_snapshot.links[index];
        if (board_link_is_ignored(link)) continue;
        const uint8_t first_slot = board_mapping_slot_for_port(link->first_port);
        const uint8_t second_slot = board_mapping_slot_for_port(link->second_port);
        const int8_t first_node_index = s_play_layout.node_for_slot[first_slot];
        const int8_t second_node_index = s_play_layout.node_for_slot[second_slot];
        if (first_node_index < 0 || second_node_index < 0) continue;
        const uint8_t first_local = board_mapping_local_port(link->first_port);
        const uint8_t second_local = board_mapping_local_port(link->second_port);
        const board_connection_color_t rgb = board_snapshot_get_color(
            link->valid ? link->color_index : BOARD_SNAPSHOT_INVALID_COLOR);
        const uint32_t color = ((uint32_t)rgb.red << 16) | ((uint32_t)rgb.green << 8) | rgb.blue;
        circuit_layout_route_t route;
        if (circuit_layout_route(&s_play_layout, 660, 492,
                                 (uint8_t)first_node_index, first_local,
                                 (uint8_t)second_node_index, second_local,
                                 index, &route)) {
            ui_draw_routed_link(layer, &area, &route, color, !link->valid);
        }
    }

    for (uint8_t index = 0; index < s_play_layout.node_count; ++index) {
        const circuit_layout_node_t *node = &s_play_layout.nodes[index];
        const board_slot_identity_t *slot = &s_play_snapshot.slots[node->slot];
        const uint32_t border = slot->id_valid ? UI_COLOR_CYAN : UI_COLOR_DANGER;
        lv_draw_rect_dsc_t body;
        lv_draw_rect_dsc_init(&body);
        body.bg_color = lv_color_hex(UI_COLOR_SURFACE_ALT);
        body.bg_opa = LV_OPA_COVER;
        body.border_color = lv_color_hex(border);
        body.border_width = 2;
        body.radius = 5;
        const lv_area_t body_area = {
            area.x1 + node->x, area.y1 + node->y,
            area.x1 + node->x + node->width, area.y1 + node->y + node->height,
        };
        lv_draw_rect(layer, &body, &body_area);

        const lv_area_t name_area = {
            body_area.x1 + 8, body_area.y1 + 5, body_area.x2 - 8, body_area.y1 + 25,
        };
        ui_draw_text(layer, ui_gate_name(slot->id_valid ? slot->gate : SSD1315_GATE_NULL),
                     &app_ui_font_cn_16, UI_COLOR_TEXT, &name_area, LV_TEXT_ALIGN_CENTER);
        if (node->height >= 52) {
            ui_draw_gate_symbol(layer, node, &area, slot->id_valid ? slot->gate : SSD1315_GATE_NULL);
        }

        for (uint8_t local = 0; local < BOARD_SNAPSHOT_PORTS_PER_SLOT; ++local) {
            const uint8_t port = node->slot * BOARD_SNAPSHOT_PORTS_PER_SLOT + local;
            const board_port_role_t role = s_play_snapshot.port_roles[port];
            if (role == BOARD_PORT_UNUSED) continue;
            const uint32_t port_color = role == BOARD_PORT_INPUT ? UI_COLOR_PINK :
                                        UI_COLOR_GREEN;
            lv_draw_rect_dsc_t dot;
            lv_draw_rect_dsc_init(&dot);
            dot.bg_color = lv_color_hex(port_color);
            dot.bg_opa = role == BOARD_PORT_UNUSED ? LV_OPA_50 : LV_OPA_COVER;
            dot.border_color = lv_color_hex(0x071016);
            dot.border_width = 1;
            dot.radius = LV_RADIUS_CIRCLE;
            const int32_t px = area.x1 + node->port_x[local];
            const int32_t py = area.y1 + node->port_y[local];
            const lv_area_t dot_area = {px - 5, py - 5, px + 5, py + 5};
            lv_draw_rect(layer, &dot, &dot_area);
        }
    }

    if (s_play_layout.node_count == 0U) {
        const lv_area_t empty = {area.x1 + 100, area.y1 + 205, area.x2 - 100, area.y1 + 250};
        ui_draw_text(layer, "把积木放到底板上吧", &app_ui_font_cn_16,
                     UI_COLOR_MUTED, &empty, LV_TEXT_ALIGN_CENTER);
    }
}

static void ui_draw_truth_bit(lv_layer_t *layer,
                              int32_t center_x,
                              int32_t center_y,
                              bool value,
                              bool available)
{
    lv_draw_rect_dsc_t bit;
    lv_draw_rect_dsc_init(&bit);
    bit.bg_color = lv_color_hex(value ? UI_COLOR_GREEN : UI_COLOR_RED);
    bit.bg_opa = available ? LV_OPA_COVER : LV_OPA_10;
    bit.border_color = lv_color_hex(available ? (value ? UI_COLOR_GREEN : UI_COLOR_RED) :
                                    UI_COLOR_MUTED);
    bit.border_width = 1;
    bit.radius = LV_RADIUS_CIRCLE;
    const int32_t radius = 4;
    const lv_area_t area = {
        center_x - radius, center_y - radius, center_x + radius, center_y + radius,
    };
    lv_draw_rect(layer, &bit, &area);
}

static void ui_draw_truth_bits(lv_layer_t *layer,
                               int32_t base_x,
                               int32_t center_y,
                               uint8_t value,
                               uint8_t count,
                               bool available)
{
    for (uint8_t bit = 0; bit < count; ++bit) {
        ui_draw_truth_bit(layer, base_x + bit * 11, center_y,
                          (value & (1U << bit)) != 0U, available);
    }
}

static void ui_truth_draw_event_cb(lv_event_t *event)
{
    lv_obj_t *truth = lv_event_get_current_target(event);
    lv_layer_t *layer = lv_event_get_layer(event);
    lv_area_t area;
    lv_obj_get_coords(truth, &area);

