ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
    const campaign_node_t *node = &ui_nodes()[s_selected_node];
    const level_rule_t *rule = level_rule_get(node->id);
    game_judge_state_t judge;
    if (rule == NULL || !game_judge_get_state(&judge)) return;

    const int32_t width = lv_area_get_width(&area);
    const int32_t height = lv_area_get_height(&area);
    const int32_t header_height = 22;
    const uint8_t row_count = rule->case_count > 0U ? rule->case_count : 1U;
    const int32_t row_height = LV_MAX(8, (height - header_height) / row_count);

    const lv_area_t header_rule = {area.x1, area.y1 + header_height - 1,
                                   area.x2, area.y1 + header_height};
    lv_draw_rect_dsc_t separator;
    lv_draw_rect_dsc_init(&separator);
    separator.bg_color = lv_color_hex(UI_COLOR_BORDER);
    separator.bg_opa = LV_OPA_COVER;
    lv_draw_rect(layer, &separator, &header_rule);

    const lv_area_t input_header = {area.x1 + 2, area.y1, area.x1 + 80, area.y1 + 20};
    const lv_area_t expected_header = {area.x1 + 88, area.y1, area.x1 + 166, area.y1 + 20};
    const lv_area_t actual_header = {area.x1 + 174, area.y1, area.x1 + width - 4, area.y1 + 20};
    ui_draw_text(layer, "输入", &app_ui_font_cn_16, UI_COLOR_CYAN,
                 &input_header, LV_TEXT_ALIGN_LEFT);
    ui_draw_text(layer, "目标", &app_ui_font_cn_16, UI_COLOR_CYAN,
                 &expected_header, LV_TEXT_ALIGN_LEFT);
    ui_draw_text(layer, "实际", &app_ui_font_cn_16, UI_COLOR_CYAN,
                 &actual_header, LV_TEXT_ALIGN_LEFT);

    for (uint8_t row = 0; row < rule->case_count; ++row) {
        const int32_t row_top = area.y1 + header_height + row * row_height;
        const int32_t row_center = row_top + row_height / 2;
        const bool active = judge.active_row_valid && judge.active_row == row &&
                            judge.phase == GAME_JUDGE_RUNNING;
        if (active) {
            lv_draw_rect_dsc_t highlight;
            lv_draw_rect_dsc_init(&highlight);
            highlight.bg_color = lv_color_hex(UI_COLOR_CYAN_DIM);
            highlight.bg_opa = LV_OPA_60;
            highlight.border_color = lv_color_hex(UI_COLOR_CYAN);
            highlight.border_width = 1;
            highlight.radius = 2;
            const lv_area_t highlight_area = {
                area.x1, row_top, area.x2, row_top + row_height - 1,
            };
            lv_draw_rect(layer, &highlight, &highlight_area);
        }

        ui_draw_truth_bits(layer, area.x1 + 12, row_center, row,
                           rule->input_count, true);
        ui_draw_truth_bits(layer, area.x1 + 98, row_center,
                           rule->expected_outputs[row], rule->output_count, true);
        ui_draw_truth_bits(layer, area.x1 + 184, row_center,
                           judge.rows[row].actual, rule->output_count,
                           judge.rows[row].complete);

        if (judge.rows[row].complete) {
            lv_draw_rect_dsc_t result_mark;
            lv_draw_rect_dsc_init(&result_mark);
            result_mark.bg_color = lv_color_hex(judge.rows[row].passed ?
                                                 UI_COLOR_GREEN : UI_COLOR_DANGER);
            result_mark.bg_opa = LV_OPA_COVER;
            result_mark.radius = LV_RADIUS_CIRCLE;
            const lv_area_t mark = {area.x2 - 10, row_center - 2,
                                    area.x2 - 6, row_center + 2};
            lv_draw_rect(layer, &result_mark, &mark);
        }
    }
}

static void ui_start_judge(void)
{
    const level_rule_t *rule = level_rule_get(ui_nodes()[s_selected_node].id);
    board_snapshot_t snapshot;
    game_judge_state_t judge;
    if (rule != NULL && board_snapshot_get(&snapshot) && game_judge_get_state(&judge) &&
        judge.phase != GAME_JUDGE_RUNNING) {
        (void)game_judge_start(rule, &snapshot);
        audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
        ui_refresh_play();
    } else {
        audio_self_test_play_effect(AUDIO_EFFECT_ERROR);
    }
}

static void ui_start_judge_event_cb(lv_event_t *event)
{
    (void)event;
    ui_start_judge();
}

static void ui_toggle_debug(void)
{
    circuit_debug_set_enabled(!circuit_debug_is_enabled());
    audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
    ui_refresh_play();
}

static void ui_toggle_debug_event_cb(lv_event_t *event)
{
    (void)event;
    ui_toggle_debug();
}

static void ui_record_node_completion(uint16_t index)
{
    if (index >= s_node_count || s_completed_nodes[index]) return;
    s_completed_nodes[index] = true;
    const esp_err_t err = campaign_progress_mark_completed(ui_nodes()[index].id);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "level %u completed in RAM but persistent save failed: %s",
                 (unsigned)ui_nodes()[index].id, esp_err_to_name(err));
    }
}

static void ui_log_play_topology(const board_snapshot_t *snapshot,
                                 const circuit_layout_t *layout)
{
    ESP_LOGI(TAG, "play topology revision=%lu nodes=%u links=%u invalid=%u",
             (unsigned long)snapshot->topology_revision, layout->node_count,
             snapshot->link_count, snapshot->invalid_link_count);
    for (uint8_t index = 0; index < snapshot->link_count; ++index) {
        const board_link_t *link = &snapshot->links[index];
        const uint8_t first_slot = board_mapping_slot_for_port(link->first_port);
        const uint8_t second_slot = board_mapping_slot_for_port(link->second_port);
        const uint8_t first_local = board_mapping_local_port(link->first_port);
        const uint8_t second_local = board_mapping_local_port(link->second_port);
        const board_port_side_t first_side = board_mapping_port_side(first_slot, first_local);
        const board_port_side_t second_side = board_mapping_port_side(second_slot, second_local);
        ESP_LOGI(TAG,
                 "play link P%u(slot%u %s present=%u id=%u role=%u node=%d) "
                 "<-> P%u(slot%u %s present=%u id=%u role=%u node=%d) valid=%u error=%u",
                 link->first_port + 1U, first_slot + 1U,
                 board_mapping_side_name(first_side),
                 snapshot->slots[first_slot].present, snapshot->slots[first_slot].id_valid,
                 snapshot->port_roles[link->first_port], layout->node_for_slot[first_slot],
                 link->second_port + 1U, second_slot + 1U,
                 board_mapping_side_name(second_side),
                 snapshot->slots[second_slot].present, snapshot->slots[second_slot].id_valid,
                 snapshot->port_roles[link->second_port], layout->node_for_slot[second_slot],
                 link->valid, link->error);
    }
}

static void ui_refresh_play(void)
{
    const campaign_node_t *node = &ui_nodes()[s_selected_node];
    const level_rule_t *rule = level_rule_get(node->id);
    board_snapshot_t latest;
    game_judge_state_t judge;
    circuit_debug_state_t debug;
    voice_assistant_status_t voice;
    if (rule == NULL || !board_snapshot_get(&latest) || !game_judge_get_state(&judge) ||
        !circuit_debug_get_state(&debug)) return;
    voice_assistant_get_status(&voice);

    const bool first_snapshot = s_play_snapshot_generation == UINT32_MAX;
    const bool snapshot_changed = latest.generation != s_play_snapshot_generation;
    const bool topology_changed = first_snapshot || latest.topology_revision != s_play_topology_revision;
    const bool judge_changed = judge.version != s_play_judge_version;
    const bool debug_changed = debug.generation != s_play_debug_generation;
    const bool voice_changed = voice.generation != s_play_voice_generation;
    if (!snapshot_changed && !judge_changed && !debug_changed && !voice_changed) return;

    if (snapshot_changed) {
        s_play_snapshot_generation = latest.generation;
    }
    if (topology_changed) {
        s_play_snapshot = latest;
        circuit_layout_compute(&s_play_snapshot, 660, 492, &s_play_layout);
        ui_log_play_topology(&s_play_snapshot, &s_play_layout);
        if (s_ui.play_circuit != NULL) lv_obj_invalidate(s_ui.play_circuit);
    }
    if (s_play_topology_revision != 0U &&
        latest.topology_revision != s_play_topology_revision &&
        judge.phase != GAME_JUDGE_IDLE && judge.phase != GAME_JUDGE_RUNNING) {
        game_judge_reset();
        game_judge_get_state(&judge);
    }
    if (topology_changed) s_play_topology_revision = latest.topology_revision;
    if (!judge_changed && !debug_changed && !voice_changed && !first_snapshot &&
        judge.version == s_play_judge_version) return;
    s_play_judge_version = judge.version;
    s_play_debug_generation = debug.generation;
    s_play_voice_generation = voice.generation;

    lv_label_set_text_fmt(s_ui.play_code, "第 %03u 关", node->id);
    lv_label_set_text(s_ui.play_title, node->title);
    snprintf(s_play_goal_text, sizeof(s_play_goal_text), "%s\n输入：%s    输出：%s",
             rule->short_goal, rule->input_names, rule->output_names);
    lv_label_set_text(s_ui.play_goal, s_play_goal_text);
    if (s_ui.play_truth != NULL) lv_obj_invalidate(s_ui.play_truth);
    const bool judging = judge.phase == GAME_JUDGE_RUNNING;
    const bool misplaced_inputs = debug.enabled && debug.misplaced_input_mask != 0U;
    const char *status_text = s_programmer_owns_input ? "摇杆和按键正在修改本地积木" :
                              voice.visible ? voice.text :
                              judging ? judge.message :
                              misplaced_inputs ? "输入积木请放到最左侧一列" :
                              debug.enabled ? "用四个开关，让信号跑起来！" : judge.message;
    lv_label_set_text(s_ui.play_status, status_text);
    lv_label_set_text(s_ui.play_action_label,
                      judging ? "正在检查..." : "启动飞船检查");
    lv_label_set_text(s_ui.play_debug_action_label,
                      debug.enabled ? "关闭开关试玩" : "开启开关试玩");
    ui_style_action_item(s_ui.play_action, s_play_action_selection == 0U, true);
    ui_style_action_item(s_ui.play_debug_action, s_play_action_selection == 1U, true);
    if (judging) {
        lv_obj_add_state(s_ui.play_action, LV_STATE_DISABLED);
    } else {
        lv_obj_remove_state(s_ui.play_action, LV_STATE_DISABLED);
    }
    lv_obj_set_style_text_color(s_ui.play_status,
                                lv_color_hex(s_programmer_owns_input ? UI_COLOR_CYAN :
                                             (voice.visible ?
                                              (voice.error ? UI_COLOR_DANGER : UI_COLOR_CYAN) :
                                             (misplaced_inputs ? UI_COLOR_DANGER :
                                             (debug.enabled && !judging ? UI_COLOR_GREEN :
                                             (judge.phase == GAME_JUDGE_PASSED ? UI_COLOR_GREEN :
                                             ((judge.phase == GAME_JUDGE_FAILED ||
                                               judge.phase == GAME_JUDGE_PRECHECK_ERROR ||
                                               judge.phase == GAME_JUDGE_CANCELLED) ?
                                              UI_COLOR_DANGER : UI_COLOR_MUTED)))))), 0);

    const bool pass_just_completed = judge_changed &&
                                     judge.phase == GAME_JUDGE_PASSED &&
                                     judge.level_id == node->id;
    if (judge_changed && judge.level_id == node->id) {
        if (judge.phase == GAME_JUDGE_PASSED) {
            audio_self_test_play_effect(AUDIO_EFFECT_WIN);
        } else if (judge.phase == GAME_JUDGE_FAILED ||
                   judge.phase == GAME_JUDGE_PRECHECK_ERROR) {
            audio_self_test_play_effect(AUDIO_EFFECT_ERROR);
        }
    }
    if (pass_just_completed && s_page == UI_PAGE_PLAY) {
        ui_record_node_completion(s_selected_node);
        s_initialize_error = false;
        ui_refresh_campaign();
        ui_refresh_success();
        ui_load_page(UI_PAGE_SUCCESS);
    }
}

