ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
static void ui_log_play_health(void)
{
    const int64_t now_us = esp_timer_get_time();
    if (now_us - s_last_play_health_log_us < 30000000LL) return;
    s_last_play_health_log_us = now_us;
    lv_mem_monitor_t memory;
    lv_mem_monitor(&memory);
    const lv_result_t integrity = lv_mem_test();
    ESP_LOGI(TAG, "play health: lvgl=%u%% free=%u largest=%u frag=%u%% integrity=%s ui_stack=%u",
             memory.used_pct, (unsigned)memory.free_size, (unsigned)memory.free_biggest_size,
             memory.frag_pct, integrity == LV_RESULT_OK ? "ok" : "failed",
             (unsigned)uxTaskGetStackHighWaterMark(NULL));
}

static void ui_create_play_screen(void)
{
    lv_obj_t *screen = lv_obj_create(NULL);
    s_ui.screen[UI_PAGE_PLAY] = screen;
    ui_style_screen(screen);
    ui_create_starfield(screen);
    ui_create_header(screen, "星际冒险", "关卡游玩", true);

    s_ui.play_circuit = ui_create_panel(screen, 18, 90, 660, 492);
    ui_add_pixel_corners(s_ui.play_circuit, UI_COLOR_CYAN);
    lv_obj_add_event_cb(s_ui.play_circuit, ui_circuit_draw_event_cb, LV_EVENT_DRAW_MAIN, NULL);
    ui_create_label(s_ui.play_circuit, "实时电路", 18, 12, 180, UI_COLOR_CYAN);

    lv_obj_t *side = ui_create_panel(screen, 694, 90, 312, 492);
    ui_add_pixel_corners(side, UI_COLOR_YELLOW);
    ui_create_accent(side, 0, 0, 124, UI_COLOR_CYAN);
    s_ui.play_code = ui_create_label(side, "", 20, 16, 272, UI_COLOR_AMBER);
    s_ui.play_title = ui_create_label(side, "", 20, 43, 272, UI_COLOR_TEXT);
    lv_obj_set_style_text_font(s_ui.play_title, &app_ui_font_cn_24, 0);
    s_ui.play_goal = ui_create_label(side, "", 20, 78, 272, UI_COLOR_MUTED);
    lv_obj_set_height(s_ui.play_goal, 64);
    ui_create_accent(side, 20, 145, 272, UI_COLOR_BORDER);
    s_ui.play_truth = lv_obj_create(side);
    lv_obj_set_pos(s_ui.play_truth, 20, 158);
    lv_obj_set_size(s_ui.play_truth, 272, 196);
    lv_obj_set_style_bg_opa(s_ui.play_truth, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(s_ui.play_truth, 0, 0);
    lv_obj_set_style_radius(s_ui.play_truth, 0, 0);
    lv_obj_set_style_pad_all(s_ui.play_truth, 0, 0);
    lv_obj_clear_flag(s_ui.play_truth, LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(s_ui.play_truth, ui_truth_draw_event_cb, LV_EVENT_DRAW_MAIN, NULL);
    s_ui.play_status = ui_create_label(side, "", 20, 358, 272, UI_COLOR_MUTED);
    lv_obj_set_height(s_ui.play_status, 42);

    s_ui.play_action = lv_button_create(side);
    lv_obj_set_pos(s_ui.play_action, 20, 404);
    lv_obj_set_size(s_ui.play_action, 272, 36);
    ui_style_action_item(s_ui.play_action, true, true);
    lv_obj_add_event_cb(s_ui.play_action, ui_start_judge_event_cb, LV_EVENT_CLICKED, NULL);
    s_ui.play_action_label = lv_label_create(s_ui.play_action);
    ui_set_font(s_ui.play_action_label);
    lv_label_set_text(s_ui.play_action_label, "启动飞船检查");
    lv_obj_set_style_text_color(s_ui.play_action_label, lv_color_hex(UI_COLOR_TEXT), 0);
    lv_obj_center(s_ui.play_action_label);

    s_ui.play_debug_action = lv_button_create(side);
    lv_obj_set_pos(s_ui.play_debug_action, 20, 448);
    lv_obj_set_size(s_ui.play_debug_action, 272, 36);
    ui_style_action_item(s_ui.play_debug_action, false, true);
    lv_obj_add_event_cb(s_ui.play_debug_action, ui_toggle_debug_event_cb, LV_EVENT_CLICKED, NULL);
    s_ui.play_debug_action_label = lv_label_create(s_ui.play_debug_action);
    ui_set_font(s_ui.play_debug_action_label);
    lv_label_set_text(s_ui.play_debug_action_label, "开启开关试玩");
    lv_obj_set_style_text_color(s_ui.play_debug_action_label, lv_color_hex(UI_COLOR_TEXT), 0);
    lv_obj_center(s_ui.play_debug_action_label);
}

static void ui_refresh_success(void)
{
    if (s_ui.success_code == NULL) return;
    const campaign_node_t *node = &ui_nodes()[s_selected_node];
    lv_label_set_text_fmt(s_ui.success_code, "第 %03u 关", node->id);
    lv_label_set_text(s_ui.success_title, node->title);
    lv_label_set_text(s_ui.success_status, "飞船检查通过！\n\n任务已经完成\n返回后还可以继续尝试其他电路");
}

static void ui_create_success_screen(void)
{
    lv_obj_t *screen = lv_obj_create(NULL);
    s_ui.screen[UI_PAGE_SUCCESS] = screen;
    ui_style_screen(screen);
    ui_create_starfield(screen);
    ui_create_header(screen, "星际冒险", "关卡游玩", true);

    lv_obj_t *panel = ui_create_panel(screen, 132, 108, 760, 430);
    ui_add_pixel_corners(panel, UI_COLOR_GREEN);
    ui_create_accent(panel, 0, 0, 220, UI_COLOR_YELLOW);
    ui_create_signal_icon(panel, 72, 118, UI_COLOR_GREEN, 1);
    s_ui.success_code = ui_create_label(panel, "", 210, 68, 500, UI_COLOR_AMBER);
    s_ui.success_title = ui_create_label(panel, "", 210, 106, 500, UI_COLOR_TEXT);
    lv_obj_set_style_text_font(s_ui.success_title, &app_ui_font_cn_24, 0);
    s_ui.success_status = ui_create_label(panel, "", 210, 158, 500, UI_COLOR_GREEN);
    lv_obj_set_height(s_ui.success_status, 160);
    ui_create_accent(panel, 210, 330, 470, UI_COLOR_CYAN_DIM);
    ui_create_label(panel, "按左键或触摸返回，继续组装", 210, 352, 470, UI_COLOR_MUTED);
}

static void ui_create_settings_screen(void)
{
    lv_obj_t *screen = lv_obj_create(NULL);
    s_ui.screen[UI_PAGE_SETTINGS] = screen;
    ui_style_screen(screen);
    ui_create_starfield(screen);
    ui_create_header(screen, "小飞船设置", "设置", true);

    lv_obj_t *side = ui_create_panel(screen, 18, 90, 244, 492);
    ui_add_pixel_corners(side, UI_COLOR_CYAN);
    ui_create_accent(side, 0, 0, 112, UI_COLOR_CYAN);
    lv_obj_t *side_title = ui_create_label(side, "图灵号", 22, 24, 200, UI_COLOR_TEXT);
    lv_obj_set_style_text_font(side_title, &app_ui_font_cn_24, 0);
    ui_create_label(side, "小飞船状态", 22, 58, 200, UI_COLOR_CYAN);
    ui_create_signal_icon(side, 78, 94, UI_COLOR_GREEN, 1);
    ui_create_accent(side, 22, 205, 200, UI_COLOR_BORDER);
    ui_create_label(side,
        "飞船状态\n正常\n\n连接接口\n64 个\n\n屏幕\n已连接\n\n控制器\n已连接",
        22, 226, 200, UI_COLOR_MUTED);

    ui_create_label(screen, "选择功能", 282, 98, 500, UI_COLOR_CYAN);
    s_ui.settings_items[UI_SETTINGS_SPEAKER_TEST] = ui_create_action_item(
        screen, 282, 126, 350, 126, "声音测试", "扬声器测试", "选中后按住中键播放 1 kHz",
        ui_settings_item_event_cb, (void *)(uintptr_t)(UI_SETTINGS_SPEAKER_TEST + 1U));
    s_ui.settings_items[UI_SETTINGS_PROGRESS_SYNC] = ui_create_action_item(
        screen, 656, 126, 350, 126, "云端同步", "上传云存档", "",
        ui_settings_item_event_cb, (void *)(uintptr_t)(UI_SETTINGS_PROGRESS_SYNC + 1U));
    s_ui.settings_sync_status = ui_create_label(
        s_ui.settings_items[UI_SETTINGS_PROGRESS_SYNC], "", 22, 84, 306, UI_COLOR_MUTED);
    s_ui.settings_items[UI_SETTINGS_UNLOCK_ALL] = ui_create_action_item(
        screen, 282, 272, 350, 126, "辅助功能", "解锁所有关卡", "",
        ui_settings_item_event_cb, (void *)(uintptr_t)(UI_SETTINGS_UNLOCK_ALL + 1U));
    s_ui.settings_unlock_status = ui_create_label(
        s_ui.settings_items[UI_SETTINGS_UNLOCK_ALL], "", 22, 84, 306, UI_COLOR_MUTED);
    s_ui.settings_items[UI_SETTINGS_INITIALIZE] = ui_create_action_item(
        screen, 656, 272, 350, 126, "游玩记录", "初始化", "",
        ui_settings_item_event_cb, (void *)(uintptr_t)(UI_SETTINGS_INITIALIZE + 1U));
    s_ui.settings_initialize_status = ui_create_label(
        s_ui.settings_items[UI_SETTINGS_INITIALIZE], "", 22, 84, 306, UI_COLOR_MUTED);
    s_ui.settings_items[UI_SETTINGS_ASSISTANT_MODE] = ui_create_action_item(
        screen, 282, 418, 724, 142, "AI 助教", "内置 / 后端", "后端地址由本机配置",
        ui_settings_item_event_cb, (void *)(uintptr_t)(UI_SETTINGS_ASSISTANT_MODE + 1U));
    s_ui.settings_assistant_status = ui_create_label(
        s_ui.settings_items[UI_SETTINGS_ASSISTANT_MODE], "", 22, 84, 620, UI_COLOR_CYAN);
    ui_add_pixel_corners(s_ui.settings_items[UI_SETTINGS_SPEAKER_TEST], UI_COLOR_CYAN);
    ui_add_pixel_corners(s_ui.settings_items[UI_SETTINGS_PROGRESS_SYNC], UI_COLOR_GREEN);
    ui_add_pixel_corners(s_ui.settings_items[UI_SETTINGS_UNLOCK_ALL], UI_COLOR_PINK);
    ui_add_pixel_corners(s_ui.settings_items[UI_SETTINGS_INITIALIZE], UI_COLOR_YELLOW);
    ui_add_pixel_corners(s_ui.settings_items[UI_SETTINGS_ASSISTANT_MODE], UI_COLOR_GREEN);
    ui_refresh_settings_selection();
}

static lv_obj_t *ui_create_diagnostic_value(lv_obj_t *panel, const char *heading)
{
    ui_create_label(panel, heading, 18, 16, 430, UI_COLOR_CYAN);
    return ui_create_label(panel, "", 18, 48, 430, UI_COLOR_TEXT);
}

static void ui_create_diagnostics_screen(void)
{
    lv_obj_t *screen = lv_obj_create(NULL);
    s_ui.screen[UI_PAGE_DIAGNOSTICS] = screen;
    ui_style_screen(screen);
    ui_create_starfield(screen);
    ui_create_header(screen, "小飞船检查", "调试界面", true);

