ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
    lv_obj_t *keys = ui_create_panel(screen, 18, 90, 300, 148);
    ui_add_pixel_corners(keys, UI_COLOR_CYAN);
    ui_create_accent(keys, 0, 0, 88, UI_COLOR_CYAN);
    s_ui.debug_keys = ui_create_diagnostic_value(keys, "按键状态");
    lv_obj_t *joystick = ui_create_panel(screen, 336, 90, 340, 148);
    ui_add_pixel_corners(joystick, UI_COLOR_YELLOW);
    ui_create_accent(joystick, 0, 0, 88, UI_COLOR_AMBER);
    s_ui.debug_joystick = ui_create_diagnostic_value(joystick, "摇杆状态");
    lv_obj_t *switches = ui_create_panel(screen, 694, 90, 312, 148);
    ui_add_pixel_corners(switches, UI_COLOR_GREEN);
    ui_create_accent(switches, 0, 0, 88, UI_COLOR_GREEN);
    s_ui.debug_switches = ui_create_diagnostic_value(switches, "开关状态");

    lv_obj_t *ir = ui_create_panel(screen, 18, 256, 300, 144);
    ui_add_pixel_corners(ir, UI_COLOR_PINK);
    ui_create_accent(ir, 0, 0, 88, UI_COLOR_AMBER);
    s_ui.debug_ir = ui_create_diagnostic_value(ir, "积木连接");
    lv_obj_t *microphone = ui_create_panel(screen, 336, 256, 670, 144);
    ui_add_pixel_corners(microphone, UI_COLOR_GREEN);
    ui_create_accent(microphone, 0, 0, 112, UI_COLOR_GREEN);
    s_ui.debug_mic = ui_create_diagnostic_value(microphone, "麦克风音量");
    lv_obj_set_style_text_font(s_ui.debug_mic, &lv_font_montserrat_22, 0);
    s_ui.debug_mic_bar = lv_bar_create(microphone);
    lv_obj_set_pos(s_ui.debug_mic_bar, 18, 98);
    lv_obj_set_size(s_ui.debug_mic_bar, 634, 18);
    lv_bar_set_range(s_ui.debug_mic_bar, 0, 2500);
    lv_bar_set_value(s_ui.debug_mic_bar, 0, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(s_ui.debug_mic_bar, lv_color_hex(UI_COLOR_GRID), LV_PART_MAIN);
    lv_obj_set_style_bg_color(s_ui.debug_mic_bar, lv_color_hex(UI_COLOR_GREEN), LV_PART_INDICATOR);
    lv_obj_set_style_radius(s_ui.debug_mic_bar, 1, LV_PART_MAIN);
    lv_obj_set_style_radius(s_ui.debug_mic_bar, 1, LV_PART_INDICATOR);

    lv_obj_t *audio = ui_create_panel(screen, 18, 420, 988, 162);
    ui_add_pixel_corners(audio, UI_COLOR_CYAN);
    ui_create_accent(audio, 0, 0, 140, UI_COLOR_CYAN);
    ui_create_label(audio, "声音测试（按住右键）", 18, 16, 500, UI_COLOR_AMBER);
    s_ui.debug_tone = ui_create_label(audio, "", 18, 51, 950, UI_COLOR_TEXT);
    ui_create_label(audio, "播放 1000 赫兹测试音", 18, 96, 950, UI_COLOR_MUTED);
    ui_create_signal_icon(audio, 870, 36, UI_COLOR_CYAN, 0);
}

static void ui_update_diagnostics(const key_input_state_t *keys,
                                  const joystick_input_state_t *joystick,
                                  uint32_t scans,
                                  uint16_t links)
{
    float rms = 0.0f;
    float tone_ratio = 0.0f;
    audio_self_test_get_microphone_level(&rms, &tone_ratio);

    lv_label_set_text_fmt(s_ui.debug_keys, "左键 %s\n中间键 %s\n右键 %s",
                          keys->key3_pressed ? "按下" : "松开",
                          keys->key1_pressed ? "按下" : "松开",
                          keys->key0_pressed ? "按下" : "松开");
    lv_label_set_text_fmt(s_ui.debug_joystick, "上 %s   下 %s\n左 %s   右 %s",
                          joystick->up_pressed ? "按下" : "松开",
                          joystick->down_pressed ? "按下" : "松开",
                          joystick->left_pressed ? "按下" : "松开",
                          joystick->right_pressed ? "按下" : "松开");
    lv_label_set_text_fmt(s_ui.debug_switches, "开关1 %s   开关2 %s\n开关3 %s   开关4 %s",
                          keys->sw1_on ? "开启" : "关闭", keys->sw2_on ? "开启" : "关闭",
                          keys->sw3_on ? "开启" : "关闭", keys->sw4_on ? "开启" : "关闭");
    lv_label_set_text_fmt(s_ui.debug_ir, "连接数量  %u\n扫描次数  %lu",
                          links, (unsigned long)scans);
    lv_label_set_text_fmt(s_ui.debug_mic, "音量  %.0f", (double)rms);
    lv_label_set_text_fmt(s_ui.debug_tone, "扬声器  %s        声音匹配  %.3f",
                          keys->key0_pressed ? "开启" : "关闭", (double)tone_ratio);
    lv_obj_set_style_text_color(s_ui.debug_keys,
                                lv_color_hex((keys->key0_pressed || keys->key1_pressed || keys->key3_pressed) ?
                                             UI_COLOR_CYAN : UI_COLOR_TEXT), 0);
    lv_obj_set_style_text_color(s_ui.debug_joystick,
                                lv_color_hex((joystick->up_pressed || joystick->down_pressed ||
                                              joystick->left_pressed || joystick->right_pressed) ?
                                             UI_COLOR_AMBER : UI_COLOR_TEXT), 0);
    lv_obj_set_style_text_color(s_ui.debug_switches,
                                lv_color_hex((keys->sw1_on || keys->sw2_on || keys->sw3_on || keys->sw4_on) ?
                                             UI_COLOR_GREEN : UI_COLOR_TEXT), 0);
    lv_obj_set_style_text_color(s_ui.debug_tone,
                                lv_color_hex(keys->key0_pressed ? UI_COLOR_AMBER : UI_COLOR_TEXT), 0);
    lv_bar_set_value(s_ui.debug_mic_bar, rms > 2500.0f ? 2500 : (int32_t)rms, LV_ANIM_OFF);
}

static void ui_load_page(ui_page_t page)
{
    if (page >= UI_PAGE_COUNT || s_ui.screen[page] == NULL) {
        return;
    }
    const bool old_play_page = s_page == UI_PAGE_PLAY || s_page == UI_PAGE_SUCCESS;
    const bool new_play_page = page == UI_PAGE_PLAY || page == UI_PAGE_SUCCESS;
    if (!old_play_page && new_play_page) {
        circuit_debug_reset();
        board_snapshot_reset(true);
        play_mode_set_active(true);
        game_judge_reset();
        s_play_snapshot_generation = UINT32_MAX;
        s_play_judge_version = UINT32_MAX;
        s_play_debug_generation = UINT32_MAX;
        s_play_voice_generation = UINT32_MAX;
        s_play_topology_revision = 0;
        s_play_action_selection = 0;
    } else if (s_page == UI_PAGE_SUCCESS && page == UI_PAGE_PLAY) {
        game_judge_reset();
        s_play_judge_version = UINT32_MAX;
    } else if (old_play_page && !new_play_page) {
        circuit_debug_reset();
        game_judge_cancel("检查已经停止");
        play_mode_set_active(false);
        board_snapshot_reset(false);
    }
    if ((s_page == UI_PAGE_DIAGNOSTICS || s_page == UI_PAGE_SETTINGS) && page != s_page) {
        audio_self_test_set_tone_enabled(false);
    }
    if (page == UI_PAGE_CAMPAIGN) {
        ui_refresh_campaign();
    } else if (page == UI_PAGE_DETAIL) {
        ui_refresh_detail();
    } else if (page == UI_PAGE_PLAY) {
        ui_refresh_play();
    } else if (page == UI_PAGE_SUCCESS) {
        ui_refresh_success();
    }
    s_page = page;
    lv_screen_load(s_ui.screen[page]);
}

static void ui_activate_home_selection(void)
{
    audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
    ui_load_page(s_home_selection == UI_HOME_CAMPAIGN ? UI_PAGE_CAMPAIGN : UI_PAGE_SETTINGS);
}

