ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
static void ui_select_nearest_node(int32_t direction_x, int32_t direction_y)
{
    const campaign_node_t *nodes = ui_nodes();
    const campaign_node_t *current = &nodes[s_selected_node];
    uint16_t best = s_selected_node;
    int64_t best_score = INT64_MAX;

    for (uint16_t index = 0; index < s_node_count; ++index) {
        if (index == s_selected_node) {
            continue;
        }
        const int32_t dx = nodes[index].x - current->x;
        const int32_t dy = nodes[index].y - current->y;
        int32_t primary;
        int32_t perpendicular;
        if (direction_x > 0 && dx > 0) {
            primary = dx;
            perpendicular = abs(dy);
        } else if (direction_x < 0 && dx < 0) {
            primary = -dx;
            perpendicular = abs(dy);
        } else if (direction_y > 0 && dy > 0) {
            primary = dy;
            perpendicular = abs(dx);
        } else if (direction_y < 0 && dy < 0) {
            primary = -dy;
            perpendicular = abs(dx);
        } else {
            continue;
        }
        /* Keep diagonal candidates out of a cardinal move at branch points. */
        if ((int64_t)perpendicular * 4 > (int64_t)primary * 5) {
            continue;
        }
        const int64_t score = (int64_t)primary * 4 + perpendicular;
        if (score < best_score) {
            best_score = score;
            best = index;
        }
    }
    if (best != s_selected_node) {
        s_selected_node = best;
        audio_self_test_play_effect(AUDIO_EFFECT_SELECT);
        ui_refresh_campaign();
    }
}

static bool ui_pressed_edge(bool current, bool previous)
{
    return current && !previous;
}

static esp_err_t ui_campaign_progression_self_test(void)
{
    const campaign_node_t *nodes = ui_nodes();
    bool completed[UI_MAX_NODES] = {0};
    const int32_t level101 = ui_find_node_index(nodes, s_node_count, 101U);
    const int32_t level102 = ui_find_node_index(nodes, s_node_count, 102U);
    const int32_t level103 = ui_find_node_index(nodes, s_node_count, 103U);
    const int32_t level150 = ui_find_node_index(nodes, s_node_count, 150U);
    const int32_t level201 = ui_find_node_index(nodes, s_node_count, 201U);
    const int32_t level202 = ui_find_node_index(nodes, s_node_count, 202U);
    const int32_t level203 = ui_find_node_index(nodes, s_node_count, 203U);
    const int32_t level301 = ui_find_node_index(nodes, s_node_count, 301U);
    const int32_t level302 = ui_find_node_index(nodes, s_node_count, 302U);
    const int32_t level550 = ui_find_node_index(nodes, s_node_count, 550U);
    const int32_t level602 = ui_find_node_index(nodes, s_node_count, 602U);
    const int32_t level650 = ui_find_node_index(nodes, s_node_count, 650U);

    if (s_node_count > UI_MAX_NODES || level101 < 0 || level102 < 0 || level103 < 0 ||
        level150 < 0 || level201 < 0 || level202 < 0 || level203 < 0 ||
        level301 < 0 || level302 < 0 ||
        level550 < 0 || level602 < 0 || level650 < 0) {
        return ESP_ERR_INVALID_STATE;
    }
    if (!ui_gate_is_unlocked_for_progress(SSD1315_GATE_INPUT, completed) ||
        !ui_gate_is_unlocked_for_progress(SSD1315_GATE_OUTPUT, completed) ||
        ui_gate_is_unlocked_for_progress(SSD1315_GATE_NAND, completed) ||
        ui_gate_is_unlocked_for_progress(SSD1315_GATE_NOT, completed) ||
        ui_gate_is_unlocked_for_progress(SSD1315_GATE_AND, completed) ||
        ui_gate_is_unlocked_for_progress(SSD1315_GATE_XNOR, completed)) {
        return ESP_ERR_INVALID_STATE;
    }
    for (uint16_t index = 0U; index < s_node_count; ++index) {
        const bool initially_unlocked = ui_node_is_unlocked_for_progress(index, completed, false);
        if (initially_unlocked != (index == (uint16_t)level101)) {
            return ESP_ERR_INVALID_STATE;
        }
        if (!ui_node_is_unlocked_for_progress(index, completed, true)) {
            return ESP_ERR_INVALID_STATE;
        }
        for (uint8_t prerequisite = 0U;
             prerequisite < nodes[index].prerequisite_count;
             ++prerequisite) {
            if (ui_find_node_index(nodes, s_node_count,
                                   nodes[index].prerequisite_ids[prerequisite]) < 0) {
                return ESP_ERR_INVALID_STATE;
            }
        }
    }

    completed[level101] = true;
    if (!ui_gate_is_unlocked_for_progress(SSD1315_GATE_NAND, completed) ||
        ui_gate_is_unlocked_for_progress(SSD1315_GATE_NOT, completed)) {
        return ESP_ERR_INVALID_STATE;
    }
    if (!ui_node_is_unlocked_for_progress((uint16_t)level102, completed, false)) {
        return ESP_ERR_INVALID_STATE;
    }
    completed[level102] = true;
    completed[level103] = true;
    if (!ui_gate_is_unlocked_for_progress(SSD1315_GATE_NOT, completed)) {
        return ESP_ERR_INVALID_STATE;
    }
    if (!ui_node_is_unlocked_for_progress((uint16_t)level150, completed, false)) {
        return ESP_ERR_INVALID_STATE;
    }
    completed[level201] = true;
    if (!ui_gate_is_unlocked_for_progress(SSD1315_GATE_AND, completed)) {
        return ESP_ERR_INVALID_STATE;
    }
    if (ui_node_is_unlocked_for_progress((uint16_t)level203, completed, false)) {
        return ESP_ERR_INVALID_STATE;
    }
    completed[level202] = true;
    if (!ui_gate_is_unlocked_for_progress(SSD1315_GATE_OR, completed)) {
        return ESP_ERR_INVALID_STATE;
    }
    if (!ui_node_is_unlocked_for_progress((uint16_t)level203, completed, false)) {
        return ESP_ERR_INVALID_STATE;
    }
    completed[level203] = true;
    if (!ui_gate_is_unlocked_for_progress(SSD1315_GATE_NOR, completed)) {
        return ESP_ERR_INVALID_STATE;
    }
    completed[level301] = true;
    completed[level302] = true;
    if (!ui_gate_is_unlocked_for_progress(SSD1315_GATE_XOR, completed) ||
        !ui_gate_is_unlocked_for_progress(SSD1315_GATE_XNOR, completed)) {
        return ESP_ERR_INVALID_STATE;
    }
    completed[level602] = true;
    if (ui_node_is_unlocked_for_progress((uint16_t)level650, completed, false)) {
        return ESP_ERR_INVALID_STATE;
    }
    completed[level550] = true;
    if (!ui_node_is_unlocked_for_progress((uint16_t)level650, completed, false) ||
        !ui_node_is_unlocked_for_progress((uint16_t)level650, completed, true)) {
        return ESP_ERR_INVALID_STATE;
    }

    ESP_LOGI(TAG, "campaign progression self-test passed: initial 101, branches, final dual prerequisite");
    return ESP_OK;
}

static esp_err_t ui_shooter_lifecycle_self_test(void)
{
    lv_mem_monitor_t initial;
    lv_mem_monitor_t warmed;
    lv_mem_monitor_t after;
    lv_mem_monitor(&initial);
    lv_obj_t *screen = shooter_game_create(1U, NULL, NULL, NULL);
    if (screen == NULL) {
        return ESP_ERR_NO_MEM;
    }
    lv_obj_t *stopped_screen = shooter_game_stop();
    if (stopped_screen != screen) {
        return ESP_FAIL;
    }
    lv_obj_delete(screen);
    if (lv_mem_test() != LV_RESULT_OK) {
        return ESP_FAIL;
    }
    lv_mem_monitor(&warmed);

    screen = shooter_game_create(1U, NULL, NULL, NULL);
    if (screen == NULL) {
        return ESP_ERR_NO_MEM;
    }
    stopped_screen = shooter_game_stop();
    if (stopped_screen != screen) {
        return ESP_FAIL;
    }
    lv_obj_delete(screen);
    if (lv_mem_test() != LV_RESULT_OK) {
        return ESP_FAIL;
    }
    lv_mem_monitor(&after);
    ESP_LOGI(TAG,
             "shooter lifecycle self-test: initial=%u warmed=%u after=%u largest=%u frag=%u%%",
             (unsigned)initial.free_size, (unsigned)warmed.free_size, (unsigned)after.free_size,
             (unsigned)after.free_biggest_size, after.frag_pct);
    return warmed.free_size == after.free_size ? ESP_OK : ESP_FAIL;
}

esp_err_t app_ui_init(void)
{
    const bsp_display_config_t hardware_config = {
        .hdmi_resolution = BSP_HDMI_RES_NONE,
        .dsi_bus = {
            .phy_clk_src = 0,
            .lane_bit_rate_mbps = BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS,
        },
    };
    bsp_lcd_handles_t lcd_handles = {0};
    esp_lv_adapter_config_t adapter_config = ESP_LV_ADAPTER_DEFAULT_CONFIG();
    adapter_config.task_stack_size = 16U * 1024U;
    adapter_config.stack_in_psram = true;

    ESP_RETURN_ON_ERROR(bsp_display_new_with_handles(&hardware_config, &lcd_handles), TAG,
                        "initialize LCD panel");
    ESP_RETURN_ON_ERROR(esp_lv_adapter_init(&adapter_config), TAG, "initialize LVGL adapter");
    esp_lv_adapter_display_config_t display_config = ESP_LV_ADAPTER_DISPLAY_MIPI_DEFAULT_CONFIG(
        lcd_handles.panel, lcd_handles.io, BSP_LCD_H_RES, BSP_LCD_V_RES, ESP_LV_ADAPTER_ROTATE_0);
    display_config.profile.buffer_height = 48U;
    display_config.profile.use_psram = true;
    lv_display_t *display = esp_lv_adapter_register_display(&display_config);
    if (display == NULL) {
        return ESP_FAIL;
    }
    esp_lcd_touch_handle_t touch = NULL;
    ESP_RETURN_ON_ERROR(bsp_touch_new(NULL, &touch), TAG, "initialize GT911 touch");
    const esp_lv_adapter_touch_config_t touch_config =
        ESP_LV_ADAPTER_TOUCH_DEFAULT_CONFIG(display, touch);
    if (esp_lv_adapter_register_touch(&touch_config) == NULL) {
        return ESP_FAIL;
    }
    ESP_RETURN_ON_ERROR(esp_lv_adapter_start(), TAG, "start LVGL task");
    ESP_RETURN_ON_ERROR(bsp_display_backlight_on(), TAG, "enable LCD backlight");
    ESP_RETURN_ON_ERROR(esp_lv_adapter_lock(-1), TAG, "lock LVGL");

