ziyan2006/esp32s3-ai-circuit-toy/main/app_ui.c
    const campaign_content_meta_t meta = campaign_content_meta();
    const campaign_node_t *nodes = campaign_content_nodes(&s_node_count);
    if (s_node_count > UI_MAX_NODES) {
        esp_lv_adapter_unlock();
        return ESP_ERR_INVALID_SIZE;
    }
    memset(s_completed_nodes, 0, sizeof(s_completed_nodes));
    const esp_err_t progress_err = campaign_progress_load(nodes, s_node_count, s_completed_nodes);
    if (progress_err != ESP_OK) {
        ESP_LOGW(TAG, "campaign progress load failed; starting with empty progress: %s",
                 esp_err_to_name(progress_err));
        memset(s_completed_nodes, 0, sizeof(s_completed_nodes));
    } else {
        ESP_LOGI(TAG, "campaign progress restored from flash");
    }
    for (s_selected_node = 0; s_selected_node < s_node_count; ++s_selected_node) {
        if (nodes[s_selected_node].id == meta.initial_level_id) {
            break;
        }
    }
    if (s_selected_node >= s_node_count) {
        s_selected_node = 0;
    }
    ESP_RETURN_ON_ERROR(ui_campaign_progression_self_test(), TAG,
                        "validate campaign unlock progression");

    ui_create_home_screen();
    ui_create_campaign_screen();
    ui_create_detail_screen();
    ui_create_play_screen();
    ui_create_success_screen();
    ui_create_settings_screen();
    ui_create_diagnostics_screen();
    ESP_RETURN_ON_ERROR(ui_shooter_lifecycle_self_test(), TAG,
                        "validate dynamic shooter screen lifecycle");
    ui_refresh_campaign();
    ui_refresh_detail();
    ui_load_page(UI_PAGE_HOME);

    lv_mem_monitor_t memory;
    lv_mem_monitor(&memory);

    esp_lv_adapter_unlock();
    ESP_LOGI(TAG, "sci-fi UI ready: %u campaign nodes, seven persistent screens; "
             "LVGL memory=%u%% free=%u largest=%u frag=%u%%",
             s_node_count, memory.used_pct, (unsigned)memory.free_size,
             (unsigned)memory.free_biggest_size, memory.frag_pct);
    return ESP_OK;
}

esp_err_t app_ui_update(const key_input_state_t *keys,
                        const joystick_input_state_t *joystick,
                        uint32_t completed_ir_scans,
                        uint16_t ir_link_pairs,
                        bool programmer_owns_input)
{
    if (keys == NULL || joystick == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    voice_assistant_update(s_page == UI_PAGE_PLAY,
                           programmer_owns_input,
                           keys->key0_pressed,
                           ui_nodes()[s_selected_node].id);
    ESP_RETURN_ON_ERROR(esp_lv_adapter_lock(-1), TAG, "lock LVGL");

    if (s_programmer_owns_input != programmer_owns_input) {
        s_programmer_owns_input = programmer_owns_input;
        s_play_judge_version = UINT32_MAX;
    }

    if (!s_input_initialized) {
        s_previous_keys = *keys;
        s_previous_joystick = *joystick;
        s_input_initialized = true;
    } else {
        const bool key1_edge = ui_pressed_edge(keys->key1_pressed, s_previous_keys.key1_pressed);
        const bool key3_edge = ui_pressed_edge(keys->key3_pressed, s_previous_keys.key3_pressed);
        const bool up_edge = ui_pressed_edge(joystick->up_pressed, s_previous_joystick.up_pressed);
        const bool down_edge = ui_pressed_edge(joystick->down_pressed, s_previous_joystick.down_pressed);
        const bool left_edge = ui_pressed_edge(joystick->left_pressed, s_previous_joystick.left_pressed);
        const bool right_edge = ui_pressed_edge(joystick->right_pressed, s_previous_joystick.right_pressed);

        if (!programmer_owns_input && key3_edge) {
            ui_back_event_cb(NULL);
        } else if (!programmer_owns_input && s_page == UI_PAGE_HOME) {
            if (left_edge && s_home_selection != UI_HOME_CAMPAIGN) {
                s_home_selection = UI_HOME_CAMPAIGN;
                audio_self_test_play_effect(AUDIO_EFFECT_SELECT);
                ui_refresh_home_selection();
            } else if (right_edge && s_home_selection != UI_HOME_SETTINGS) {
                s_home_selection = UI_HOME_SETTINGS;
                audio_self_test_play_effect(AUDIO_EFFECT_SELECT);
                ui_refresh_home_selection();
            }
            if (key1_edge) {
                ui_activate_home_selection();
            }
        } else if (!programmer_owns_input && s_page == UI_PAGE_SETTINGS) {
            progress_sync_status_t progress_status;
            progress_sync_get_status(&progress_status);
            if (!s_progress_sync_status_initialized ||
                memcmp(&progress_status, &s_last_progress_sync_status, sizeof(progress_status)) != 0) {
                ui_refresh_settings_selection();
            }
            if (up_edge || down_edge) {
                if (up_edge) {
                    s_settings_selection = s_settings_selection == 0U ?
                        UI_SETTINGS_COUNT - 1U : s_settings_selection - 1U;
                } else {
                    s_settings_selection = (s_settings_selection + 1U) % UI_SETTINGS_COUNT;
                }
                audio_self_test_play_effect(AUDIO_EFFECT_SELECT);
                ui_refresh_settings_selection();
            }
            if (key1_edge && s_settings_selection != UI_SETTINGS_SPEAKER_TEST) {
                if (s_settings_selection == UI_SETTINGS_PROGRESS_SYNC) {
                    const esp_err_t err = progress_sync_request(
                        ui_nodes(), s_node_count, s_completed_nodes);
                    audio_self_test_play_effect(err == ESP_OK ? AUDIO_EFFECT_CONFIRM : AUDIO_EFFECT_ERROR);
                    ui_refresh_settings_selection();
                } else if (s_settings_selection == UI_SETTINGS_UNLOCK_ALL) {
                    if (!s_unlock_all_nodes) {
                        s_unlock_all_nodes = true;
                        audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
                        ui_refresh_settings_selection();
                        ui_refresh_campaign();
                        ui_refresh_detail();
                        ESP_LOGI(TAG, "all campaign nodes unlocked for this boot");
                    }
                } else if (s_settings_selection == UI_SETTINGS_ASSISTANT_MODE) {
                    const assistant_mode_t next = assistant_mode_get() == ASSISTANT_MODE_LOCAL ?
                        ASSISTANT_MODE_REMOTE : ASSISTANT_MODE_LOCAL;
                    const esp_err_t err = assistant_mode_set(next);
                    if (err == ESP_OK) {
                        assistant_router_handle_mode_change();
                        audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
                    } else {
                        audio_self_test_play_effect(AUDIO_EFFECT_ERROR);
                    }
                    ui_refresh_settings_selection();
                } else {
                    const esp_err_t err = campaign_progress_clear();
                    s_initialize_error = err != ESP_OK;
                    if (err == ESP_OK) {
                        memset(s_completed_nodes, 0, sizeof(s_completed_nodes));
                        s_unlock_all_nodes = false;
                        const campaign_content_meta_t meta = campaign_content_meta();
                        const campaign_node_t *nodes = ui_nodes();
                        s_selected_node = 0U;
                        for (uint16_t index = 0U; index < s_node_count; ++index) {
                            if (nodes[index].id == meta.initial_level_id) {
                                s_selected_node = index;
                                break;
                            }
                        }
                        audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
                        ui_refresh_settings_selection();
                        ui_refresh_campaign();
                        ui_refresh_detail();
                        ESP_LOGI(TAG, "campaign progress initialized from settings");
                    } else {
                        audio_self_test_play_effect(AUDIO_EFFECT_ERROR);
                        ui_refresh_settings_selection();
                    }
                }
            }
        } else if (!programmer_owns_input && s_page == UI_PAGE_CAMPAIGN) {
            if (up_edge) ui_select_nearest_node(0, -1);
            if (down_edge) ui_select_nearest_node(0, 1);
            if (left_edge) ui_select_nearest_node(-1, 0);
            if (right_edge) ui_select_nearest_node(1, 0);
            if (key1_edge) {
                audio_self_test_play_effect(AUDIO_EFFECT_CONFIRM);
                ui_load_page(UI_PAGE_DETAIL);
            }
        } else if (!programmer_owns_input && s_page == UI_PAGE_DETAIL) {
            if (key1_edge) ui_start_play();
        } else if (!programmer_owns_input && s_page == UI_PAGE_PLAY) {
            if (up_edge || down_edge) {
                s_play_action_selection = s_play_action_selection == 0U ? 1U : 0U;
                audio_self_test_play_effect(AUDIO_EFFECT_SELECT);
                ui_style_action_item(s_ui.play_action, s_play_action_selection == 0U, true);
                ui_style_action_item(s_ui.play_debug_action, s_play_action_selection == 1U, true);
            }
            if (key1_edge) {
                if (s_play_action_selection == 0U) {
                    ui_start_judge();
                } else {
                    ui_toggle_debug();
                }
            }
        }
    }

    const bool settings_tone = s_page == UI_PAGE_SETTINGS &&
                               s_settings_selection == UI_SETTINGS_SPEAKER_TEST &&
                               keys->key1_pressed;
    if (s_page == UI_PAGE_DIAGNOSTICS) {
        audio_self_test_set_tone_enabled(keys->key0_pressed);
        ui_update_diagnostics(keys, joystick, completed_ir_scans, ir_link_pairs);
    } else {
        audio_self_test_set_tone_enabled(settings_tone);
    }
    if (s_page == UI_PAGE_PLAY) {
        ui_refresh_play();
        ui_log_play_health();
    } else if (s_page == UI_PAGE_SHOOTER) {
        shooter_game_set_input(keys, joystick);
    }

    s_previous_keys = *keys;
    s_previous_joystick = *joystick;
    esp_lv_adapter_unlock();
    return ESP_OK;
}
